kernel/virt/live-migration.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2025-02-13 Thu 22:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>QEMU热迁移机制</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">QEMU热迁移机制</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org616e822">1. 脏页跟踪机制</a>
<ul>
<li><a href="#orgbdba159">1.1. PML功能基本介绍</a></li>
<li><a href="#org64f86ed">1.2. qemu侧开启脏页记录</a></li>
<li><a href="#org235a4e0">1.3. kvm侧开启脏页记录</a></li>
<li><a href="#org0dcf539">1.4. kvm侧记录脏页流程</a></li>
<li><a href="#org137e839">1.5. qemu侧记录/获取脏页流程</a></li>
</ul>
</li>
<li><a href="#org6ad644e">2. 迁移第一阶段</a></li>
<li><a href="#org2ddf50f">3. 迁移第二阶段</a></li>
<li><a href="#org4eadc6a">4. 迁移第三阶段</a></li>
<li><a href="#org5c3b99c">5. dst端还原虚拟机</a></li>
</ul>
</div>
</div>
<div id="outline-container-org616e822" class="outline-2">
<h2 id="org616e822"><span class="section-number-2">1.</span> 脏页跟踪机制</h2>
<div class="outline-text-2" id="text-1">
<p>
脏页信息最开始在内核侧kvm里记录，现在记录虚拟机写了哪些页面信息有两种方式，一是软件方式，将所有虚拟机使用的内存属性都改成写保护，这样每次虚拟机访问内存时，都会触发写保护异常，在异常流程里可以记录虚拟机访问了哪些页面，并且这次记录好了之后，退出异常流程前还要再次开启写保护，以使得下次可能还会访问该页面时，可以再次得到记录．
</p>

<p>
很显然，上述机制效率是低下的，另外一种硬件机制是Page Modification Log．本文主要基于PML这种硬件机制来介绍脏页追踪的功能．
</p>

<p>
PML硬件记录脏页的功能需要由qemu用户侧主动开启，代码流程会一路向下到内核kvm里，这里先介绍下Intel SDM对PML功能的说明。
</p>
</div>
<div id="outline-container-orgbdba159" class="outline-3">
<h3 id="orgbdba159"><span class="section-number-3">1.1.</span> PML功能基本介绍</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Intel SDM3 27.2.6对PML有较为详细的介绍，这里简单总结下，PML可以开出一页的内存，每当虚拟机访问GPA时，最重要的信息GPA虚拟机物理地址就会作为一个entry放入这一页内存里，一页4KB的空间，共计512个entry．这一页的物理内存地址可以放入VMCS的PML Address域里，另外还有一个PML index域，用来指示现在将访问entry放入哪个位置．
</p>
</div>
</div>
