kernel/virt/live-migration.html
<div id="outline-container-org64f86ed" class="outline-3">
<h3 id="org64f86ed"><span class="section-number-3">1.2.</span> qemu侧开启脏页记录</h3>
<div class="outline-text-3" id="text-1-2">
<p>
qemu侧开启脏页记录的一个路径可以是（逐步向下增长调用路径上的函数）：
</p>
<pre class="example" id="org63932f3">
hmp_migrate-&gt;qmp_migrate
</pre>
<pre class="example" id="org08a96c0">
ERST

    {
        .name       = "migrate",
        .args_type  = "detach:-d,blk:-b,inc:-i,resume:-r,uri:s",
        .params     = "[-d] [-b] [-i] [-r] uri",
        .help       = "migrate to URI (using -d to not wait for completion)"
		      "\n\t\t\t -b for migration without shared storage with"
		      " full copy of disk\n\t\t\t -i for migration without "
		      "shared storage with incremental copy of disk "
		      "(base image shared between src and destination)"
                      "\n\t\t\t -r to resume a paused migration",
        .cmd        = hmp_migrate,
    },


SRST
``migrate [-d] [-b] [-i]`` *uri*
  Migrate to *uri* (using -d to not wait for completion).

  ``-b``
    for migration with full copy of disk
  ``-i``
    for migration with incremental copy of disk (base image is shared)

</pre>
<p>
在qmp_migrate里依据不同uri接口可以调用不同的函数，比如tcp，unix以及vsock都走socket_start_outgoing_migration：
</p>
<pre class="example" id="orgcc66244">
socket_start_outgoing_migration-&gt;socket_start_outgoing_migration_internal
</pre>
<p>
在socket_start_outgoing_migration_internal函数里以socket_outgoing_migration作为callback调用qio_channel_socket_connect_async：
</p>
<pre class="example" id="org455b985">
qio_channel_socket_connect_async(sioc,
                                 saddr,
                                 socket_outgoing_migration,
                                 data,
                                 socket_connect_data_free,
                                 NULL);
</pre>
<p>
qio_channel_socket_connect_async函数里将socket_outgoing_migration作为callback参数调用qio_task_new构造一个QIOTask：
</p>
<pre class="example" id="org9fae535">
QIOTask *task = qio_task_new(
    OBJECT(ioc), callback, opaque, destroy);
SocketAddress *addrCopy;
</pre>
<pre class="example" id="org69ea7a5">
QIOTask *qio_task_new(Object *source,
                      QIOTaskFunc func,
                      gpointer opaque,
                      GDestroyNotify destroy)
{
    QIOTask *task;
    ...
    task-&gt;func = func;
    ...
    return task;
}
</pre>
<p>
这里可以看到，socket_outgoing_migration给到了QIOTask.func成员，那么为什么叫IO呢？可以理解虚拟机迁移，其实也就是将当前节点的内存发送到另外的节点，可以理解成IO操作．
</p>

<p>
然后qio_channel_socket_connect_async调用qio_task_run_in_thread函数，构造出的task作为第一个参数：
</p>
<pre class="example" id="org84c6dc2">
qio_task_run_in_thread(task,
                       qio_channel_socket_connect_worker,
                       addrCopy,
                       (GDestroyNotify)qapi_free_SocketAddress,
                       context);
</pre>
<p>
最终会运行到开始提到的回调函数socket_outgoing_migration，该函数向下又有调用：
</p>
<pre class="example" id="org02a8b8c">
socket_outgoing_migration-&gt;migration_channel_connect-&gt;migrate_fd_connect
</pre>
<p>
在migrate_fd_connect函数里，会创建一个名为live_migration的线程：
</p>
<pre class="example" id="org5873faa">
qemu_thread_create(&amp;s-&gt;thread, "live_migration",
        migration_thread, s, QEMU_THREAD_JOINABLE);
</pre>
<p>
该live_migration线程的工作函数为migration_thread，它向下又有调用链：
</p>
<pre class="example" id="orgbbe2777">
migration_thread-&gt;qemu_savevm_state_setup-&gt;save_setup(ram_save_setup)-&gt;ram_init_all-&gt;ram_init_bitmaps
</pre>
<p>
在ram_init_bitmaps里以GLOBAL_DIRTY_MIGRATION这个标志（原因）启动脏页记录：
</p>
<pre class="example" id="org757c248">
memory_global_dirty_log_start(GLOBAL_DIRTY_MIGRATION);
</pre>
<p>
这个标志其意思就是现在因为迁移要开启了，所以哪些是脏页要记录下来，后面需要迁移这些脏页．除了开始迁移需要记录脏页，还有一个原因也可以开启脏页：
</p>
<pre class="example" id="orgdbfa377">
/* Possible bits for global_dirty_log_{start|stop} */

/* Dirty tracking enabled because migration is running */
#define GLOBAL_DIRTY_MIGRATION  (1U &lt;&lt; 0)

/* Dirty tracking enabled because measuring dirty rate */
#define GLOBAL_DIRTY_DIRTY_RATE (1U &lt;&lt; 1)

#define GLOBAL_DIRTY_MASK  (0x3)
</pre>
<p>
memory_global_dirty_log_start函数里先把传进来的GLOBAL_DIRTY_MIGRATION和global_dirty_tracking相或又给到global_dirty_tracking，这样global_dirty_tracking就有一个新的比特位第bit 0位被设置了，其肯定不为0：
</p>
<pre class="example" id="org18adb34">
global_dirty_tracking |= flags;
</pre>
<p>
然后memory_global_dirty_log_start继续向下调：
</p>
<pre class="example" id="orgdf03e1d">
memory_region_transaction_commit-&gt;flatviews_reset-&gt;generate_memory_topology-&gt;render_memory_region
</pre>
<p>
在render_memory_region函数里有：
</p>
<pre class="example" id="org774a4aa">
...
FlatRange fr;
...
fr.dirty_log_mask = memory_region_get_dirty_log_mask(mr);
</pre>
<p>
而memory_region_get_dirty_log_mask如下：
</p>
<pre class="example" id="org6cad10a">
uint8_t memory_region_get_dirty_log_mask(MemoryRegion *mr)
{
    uint8_t mask = mr-&gt;dirty_log_mask;
    RAMBlock *rb = mr-&gt;ram_block;

    if (global_dirty_tracking &amp;&amp; ((rb &amp;&amp; qemu_ram_is_migratable(rb)) ||
                             memory_region_is_iommu(mr))) {
        mask |= (1 &lt;&lt; DIRTY_MEMORY_MIGRATION);
    }

    if (tcg_enabled() &amp;&amp; rb) {
        /* TCG only cares about dirty memory logging for RAM, not IOMMU.  */
        mask |= (1 &lt;&lt; DIRTY_MEMORY_CODE);
    }
    return mask;
}
</pre>
<p>
这里最主要的条件其实就是global_dirty_tracking，前面看到了global_dirty_tracking第0位被设置了，其肯定是有值的，所以返回的mask其第DIRTY_MEMORY_MIGRATION个比特位也就被设置了（就是bit 2）．memory_region_transaction_commit完成对flatviews_reset的调用后（就是设置新的FlatRange:dirty_log_mask）又调用address_space_set_flatview：
</p>
<pre class="example" id="orgf16308f">
memory_region_transaction_commit-&gt;address_space_set_flatview-&gt;address_space_update_topology_pass
</pre>
<p>
在address_space_update_topology_pass里就可以看到利用FlatRange:dirty_log_mask作为条件判断是否开启脏页记录了：
</p>
<pre class="example" id="org1c5e2e7">
static void address_space_update_topology_pass(AddressSpace *as,
                                               const FlatView *old_view,
                                               const FlatView *new_view,
                                               bool adding)
{
    ...
    FlatRange *frold, *frnew;
    ...
            if (adding) {
                MEMORY_LISTENER_UPDATE_REGION(frnew, as, Forward, region_nop);
                if (frnew-&gt;dirty_log_mask &amp; ~frold-&gt;dirty_log_mask) {
                    MEMORY_LISTENER_UPDATE_REGION(frnew, as, Forward, log_start,
                                                  frold-&gt;dirty_log_mask,
                                                  frnew-&gt;dirty_log_mask);
                }
                if (frold-&gt;dirty_log_mask &amp; ~frnew-&gt;dirty_log_mask) {
                    MEMORY_LISTENER_UPDATE_REGION(frnew, as, Reverse, log_stop,
                                                  frold-&gt;dirty_log_mask,
                                                  frnew-&gt;dirty_log_mask);
                }
    
}
</pre>
<p>
条件frnew-&gt;dirty_log_mask &amp; ~frold-&gt;dirty_log_mask就是说原来旧的FlatRange:dirty_log_mask没有设置的而新的FlatRange:dirty_log_mask有设置的话，就调用MEMORY_LISTENER_UPDATE_REGION进行更新，可以看到调用它的第四个参数是log_start，而MEMORY_LISTENER_UPDATE_REGION的实现如下：
</p>
<pre class="example" id="org9440287">
#define MEMORY_LISTENER_UPDATE_REGION(fr, as, dir, callback, _args...)  \
    do {                                                                \
        MemoryRegionSection mrs = section_from_flat_range(fr,           \
                address_space_to_flatview(as));                         \
        MEMORY_LISTENER_CALL(as, callback, dir, &amp;mrs, ##_args);         \
    } while(0)
</pre>
<p>
在MEMORY_LISTENER_CALL里会调用log_start这个函数了：
</p>
<pre class="example" id="org7cb42ef">
_listener-&gt;_callback(_listener, _section, ##_args);
</pre>
<p>
对于kvm memory listener来说，这个log_start函数就是kvm_log_start：
</p>
<pre class="example" id="org0bb4e18">
kml-&gt;listener.log_start = kvm_log_start;
</pre>
<p>
关于其初始化的流程，本文就不赘述了．
kvm_log_start有如下调用链：
</p>
<pre class="example" id="org7361105">
kvm_log_start-&gt;kvm_section_update_flags-&gt;kvm_slot_update_flags
</pre>
<p>
kvm_slot_update_flags函数定义如下：
</p>
<pre class="example" id="orga2fd4b5">
static int kvm_slot_update_flags(KVMMemoryListener *kml, KVMSlot *mem,
                                 MemoryRegion *mr)
{
    mem-&gt;flags = kvm_mem_flags(mr);

    /* If nothing changed effectively, no need to issue ioctl */
    if (mem-&gt;flags == mem-&gt;old_flags) {
        return 0;
    }

    kvm_slot_init_dirty_bitmap(mem);
    return kvm_set_user_memory_region(kml, mem, false);
}

</pre>
<p>
先是调用了kvm_mem_flags，然后调用kvm_set_user_memory_region．先看kvm_mem_flags：
</p>
<pre class="example" id="orgc899fc7">
static int kvm_mem_flags(MemoryRegion *mr)
{
    bool readonly = mr-&gt;readonly || memory_region_is_romd(mr);
    int flags = 0;

    if (memory_region_get_dirty_log_mask(mr) != 0) {
        flags |= KVM_MEM_LOG_DIRTY_PAGES;
    }
    if (readonly &amp;&amp; kvm_readonly_mem_allowed) {
        flags |= KVM_MEM_READONLY;
    }
    return flags;
}
</pre>
<p>
这里重点关注给flags或上了KVM_MEM_LOG_DIRTY_PAGES，而这个标志内核里的kvm模块能够识别，并用来开启硬件PML，这个流程在下节＂kvm侧开启脏页记录＂会详细描述．注意这里判断是否要给flags或上KVM_MEM_LOG_DIRTY_PAGES这个标志，采用了函数memory_region_get_dirty_log_mask的返回值进行判断，前面分析过，只要global_dirty_tracking有值，其返回值非0，这样kvm_mem_flags返回的flags肯定就置上了KVM_MEM_LOG_DIRTY_PAGES．
</p>

<p>
kvm_slot_update_flags随后调用了kvm_set_user_memory_region，在后者函数里有代码：
</p>
<pre class="example" id="orgba38186">
static int kvm_set_user_memory_region(KVMMemoryListener *kml, KVMSlot *slot, bool new)
{
    ...
    struct kvm_userspace_memory_region mem;
    mem.flags = slot-&gt;flags;
    ...
        ret = kvm_vm_ioctl(s, KVM_SET_USER_MEMORY_REGION, &amp;mem);
    ...
}
</pre>
<p>
slot-&gt;flags是带有KVM_MEM_LOG_DIRTY_PAGES的，这里又给到了kvm_userspace_memory_region:flags，因为内核kvm和qemu都可以识别kvm_userspace_memory_region这个结构体，显而易见，这个mem（kvm_userspace_memory_region）就要通过ioctl系统调用带到内核态了．
从这里向下就到内核了，以KVM_SET_USER_MEMORY_REGION命令进入ioctl，后续kvm的流程留到下节．
</p>
</div>
</div>
