kernel/virt/live-migration.html

<div id="outline-container-org235a4e0" class="outline-3">
<h3 id="org235a4e0"><span class="section-number-3">1.3.</span> kvm侧开启脏页记录</h3>
<div class="outline-text-3" id="text-1-3">
<p>
当kvm_vm_ioctl来到内核时，kvm里有个同名函数会处理这个ioctl请求：
</p>
<pre class="example" id="org051421b">
static long kvm_vm_ioctl(struct file *filp,
			   unsigned int ioctl, unsigned long arg)
{
    ...
	case KVM_SET_USER_MEMORY_REGION: {
		struct kvm_userspace_memory_region kvm_userspace_mem;

		r = -EFAULT;
		if (copy_from_user(&amp;kvm_userspace_mem, argp,
						sizeof(kvm_userspace_mem)))
			goto out;

		r = kvm_vm_ioctl_set_memory_region(kvm, &amp;kvm_userspace_mem);
		break;
	}
    ...
}
</pre>
<p>
可以看到这个case就是qemu调用ioctl的命令编号：KVM_SET_USER_MEMORY_REGION．同时可以看到，用户态传来的kvm_userspace_memory_region通过copy_from_user拷贝了内核态里的kvm_userspace_mem，其flags带有KVM_MEM_LOG_DIRTY_PAGES．
</p>

<p>
从kvm_vm_ioctl_set_memory_region向下有如下调用链：
</p>
<pre class="example" id="orgb5df28e">
kvm_vm_ioctl_set_memory_region-&gt;kvm_set_memory_region-&gt;__kvm_set_memory_region
</pre>
<p>
在__kvm_set_memory_region里，又引入了kvm_memory_slot概念：
</p>
<pre class="example" id="orgd77962d">
int __kvm_set_memory_region(struct kvm *kvm,
			    const struct kvm_userspace_memory_region *mem)
{
	struct kvm_memory_slot old, new;
	...
	new.flags = mem-&gt;flags;
}
</pre>
<p>
在这里可以看到，带有KVM_MEM_LOG_DIRTY_PAGES标志的flags又被转给了kvm_memory_slot:flags．从__kvm_set_memory_region继续往下：
</p>
<pre class="example" id="org2949238">
__kvm_set_memory_region-&gt;kvm_arch_commit_memory_region-&gt;kvm_mmu_slot_apply_flags
</pre>
<p>
在kvm_mmu_slot_apply_flags函数里：
</p>
<pre class="example" id="orgb1e8ac3">
static void kvm_mmu_slot_apply_flags(struct kvm *kvm,
				     struct kvm_memory_slot *old,
				     struct kvm_memory_slot *new,
				     enum kvm_mr_change change)
{
	bool log_dirty_pages = new-&gt;flags &amp; KVM_MEM_LOG_DIRTY_PAGES;

	/*
	 * Update CPU dirty logging if dirty logging is being toggled.  This
	 * applies to all operations.
	 */
	if ((old-&gt;flags ^ new-&gt;flags) &amp; KVM_MEM_LOG_DIRTY_PAGES)
		kvm_mmu_update_cpu_dirty_logging(kvm, log_dirty_pages);
	...
}
</pre>
<p>
log_dirty_pages相当于是取出了kvm_memory_slot:flags里第KVM_MEM_LOG_DIRTY_PAGES这个bit位的设置情况，log_dirty_pages为0代表没有设置，为1代表设置了．下面的if判断条件意义是：只要原来flags和新的flags在KVM_MEM_LOG_DIRTY_PAGES这个比特位上发生变化时，都会调用kvm_mmu_update_cpu_dirty_logging函数，但是注意第二个参数指定了是否开启PML，kvm_mmu_slot_apply_flags定义如下：
</p>
<pre class="example" id="org1a48d78">
static void kvm_mmu_update_cpu_dirty_logging(struct kvm *kvm, bool enable)
{
	struct kvm_arch *ka = &amp;kvm-&gt;arch;

	if (!kvm_x86_ops.cpu_dirty_log_size)
		return;

	if ((enable &amp;&amp; ++ka-&gt;cpu_dirty_logging_count == 1) ||
	    (!enable &amp;&amp; --ka-&gt;cpu_dirty_logging_count == 0))
		kvm_make_all_cpus_request(kvm, KVM_REQ_UPDATE_CPU_DIRTY_LOGGING);

	WARN_ON_ONCE(ka-&gt;cpu_dirty_logging_count &lt; 0);
}
</pre>
<p>
一般开启PML功能第一个条件就会满足．kvm_make_all_cpus_request只是将KVM_REQ_UPDATE_CPU_DIRTY_LOGGING这个请求给挂到vcpu-&gt;requests了，并没有立即写硬件相关的bit位．如下调用链：
</p>
<pre class="example" id="org58887ed">
kvm_make_all_cpus_request-&gt;kvm_make_all_cpus_request_except-&gt;kvm_make_vcpus_request_mask-&gt;kvm_make_request
</pre>
<p>
最后的kvm_make_request如下：
</p>
<pre class="example" id="org9d10fa9">
static inline void kvm_make_request(int req, struct kvm_vcpu *vcpu)
{
	/*
	 * Ensure the rest of the request is published to kvm_check_request's
	 * caller.  Paired with the smp_mb__after_atomic in kvm_check_request.
	 */
	smp_wmb();
	set_bit(req &amp; KVM_REQUEST_MASK, (void *)&amp;vcpu-&gt;requests);
}
</pre>
<p>
可以看到只是设了一个bit位．那么什么时候设置硬件的比特位，以开启PML功能呢？搜索KVM_REQ_UPDATE_CPU_DIRTY_LOGGING知道，在下一次通过vcpu_enter_guest进入虚拟机时会处理挂在vcpu-&gt;requests上的请求：
</p>
<pre class="example" id="orgc22a133">
if (kvm_check_request(KVM_REQ_UPDATE_CPU_DIRTY_LOGGING, vcpu))
	static_call(kvm_x86_update_cpu_dirty_logging)(vcpu);
</pre>
<p>
kvm_x86_update_cpu_dirty_logging符号通过KVM_X86_OP_NULL展开：
</p>
<pre class="example" id="org5a927cd">
KVM_X86_OP_NULL(update_cpu_dirty_logging)
#define KVM_X86_OP(func) \
	DECLARE_STATIC_CALL(kvm_x86_##func, *(((struct kvm_x86_ops *)0)-&gt;func));
#define DECLARE_STATIC_CALL(name, func)					\
	extern struct static_call_key STATIC_CALL_KEY(name);		\
	extern typeof(func) STATIC_CALL_TRAMP(name);
</pre>
<p>
可以看到，最后实际调用的是kvm_x86_ops:update_cpu_dirty_logging，其就是vmx_update_cpu_dirty_logging：
</p>
<pre class="example" id="org3ae328b">
.update_cpu_dirty_logging = vmx_update_cpu_dirty_logging,
</pre>
<p>
vmx_update_cpu_dirty_logging会调用secondary_exec_controls_setbit：
</p>
<pre class="example" id="org6d508a3">
secondary_exec_controls_setbit(vmx, SECONDARY_EXEC_ENABLE_PML);
</pre>
<p>
SECONDARY_EXEC_ENABLE_PML定义如下：
</p>
<pre class="example" id="org107c950">
#define SECONDARY_EXEC_ENABLE_PML               VMCS_CONTROL_BIT(PAGE_MOD_LOGGING)
#define VMCS_CONTROL_BIT(x)	BIT(VMX_FEATURE_##x &amp; 0x1f)
#define BIT(nr)			(UL(1) &lt;&lt; (nr))
#define VMX_FEATURE_PAGE_MOD_LOGGING	( 2*32+ 17) /* "pml" Log dirty pages into buffer */
</pre>
<p>
这其实就是Secondary Processor-Based VM-Execution Controls的第17个bit位，intel虚拟化手册对这个位解释如下：
</p>
<pre class="example" id="orgf79c458">
17 Enable PML If this control is 1, an access to a guest-physical address that sets an EPT dirty bit first adds an entry to the page-modification. See Section 27.2.6.
</pre>
<p>
可以很清楚的看到，这个bit就是开启PML功能的．
</p>

<p>
再来看secondary_exec_controls_setbit的定义，其是宏定义拼接的：
</p>
<pre class="example" id="org4764d88">
BUILD_CONTROLS_SHADOW(secondary_exec, SECONDARY_VM_EXEC_CONTROL)
#define BUILD_CONTROLS_SHADOW(lname, uname)				    \
static inline void lname##_controls_set(struct vcpu_vmx *vmx, u32 val)	    \
{									    \
	if (vmx-&gt;loaded_vmcs-&gt;controls_shadow.lname != val) {		    \
		vmcs_write32(uname, val);				    \
		vmx-&gt;loaded_vmcs-&gt;controls_shadow.lname = val;		    \
	}								    \
}									    \
static inline u32 __##lname##_controls_get(struct loaded_vmcs *vmcs)	    \
{									    \
	return vmcs-&gt;controls_shadow.lname;				    \
}									    \
static inline u32 lname##_controls_get(struct vcpu_vmx *vmx)		    \
{									    \
	return __##lname##_controls_get(vmx-&gt;loaded_vmcs);		    \
}									    \
static inline void lname##_controls_setbit(struct vcpu_vmx *vmx, u32 val)   \
{									    \
	lname##_controls_set(vmx, lname##_controls_get(vmx) | val);	    \
}									    \
static inline void lname##_controls_clearbit(struct vcpu_vmx *vmx, u32 val) \
{									    \
	lname##_controls_set(vmx, lname##_controls_get(vmx) &amp; ~val);	    \
}
</pre>
<p>
先看SECONDARY_VM_EXEC_CONTROL的实现，它是在vmcs中的一个偏移：
</p>
<pre class="example" id="org7048405">
enum vmcs_field {
...
	SECONDARY_VM_EXEC_CONTROL       = 0x0000401e,
...
}
</pre>
<p>
这个偏移在intel虚拟化手册里的定义正是Secondary Processor-Based VM-Execution Controls寄存器。
</p>

<p>
再看secondary_exec_controls_setbit的实现，先通过secondary_exec_controls_get拿到原来的vmcs-&gt;controls_shadow:secondary_exec这个u32的值和新的val（1&lt;&lt;17）相或，然后在secondary_controls_set里通过vmcs_write32写到当前vmcs的secondary exec control字段，这样就启动了PML功能，关于vmcs_write32的实现如下，当然最后肯定是内联了：
</p>

<pre class="example" id="org35aa188">
static __always_inline void vmcs_write32(unsigned long field, u32 value)
{
	vmcs_check32(field);
	if (static_branch_unlikely(&amp;enable_evmcs))
		return evmcs_write32(field, value);

	__vmcs_writel(field, value);
}

static __always_inline void __vmcs_writel(unsigned long field, unsigned long value)
{
	vmx_asm2(vmwrite, "r"(field), "rm"(value), field, value);
}
</pre>
<p>
vmwrite就是操作当前cpu的VMCS，关于它intel虚拟化手册有详尽描述．
</p>
</div>
</div>
