kernel/virt/live-migration.html

<div id="outline-container-org0dcf539" class="outline-3">
<h3 id="org0dcf539"><span class="section-number-3">1.4.</span> kvm侧记录脏页流程</h3>
<div class="outline-text-3" id="text-1-4">
<p>
在前面介绍了qemu+kvm共同开启了PML硬件记录脏页的功能，本小节想分析下kvm内核侧记录脏页的流程，根据intel虚拟化手册，本质上开启PML后，脏页的记录实际上由cpu自动完成，每当guest虚拟机访问内存时，cpu会自动将GPA记录到pml buffer里，软件没有太多的工作，软件里主要是在pml buffer满时将脏信息搬移到dirty ring环形区里，qemu 6.2使用了kvm内核里的kvm_vcpu:dirty_ring以提高效率，而qemu 4.2使用了kvm内核里传统的kvm_memory_slot:dirty_bitmap，后面主要分析dirty ring的方式，而简单分析下dirty_bitmap方式．使用dirty ring的方式避免了内核态/用户态的数据拷贝，提高了效率，后面将详细看到这个过程．
</p>

<p>
首先在创建vcpu而初始化vmcs的流程里vmx_create_vcpu-&gt;init_vmcs：
</p>
<pre class="example" id="orgd02cb07">
if (enable_pml) {
	    vmcs_write64(PML_ADDRESS, page_to_phys(vmx-&gt;pml_pg));
	    vmcs_write16(GUEST_PML_INDEX, PML_ENTITY_NUM - 1);
    }
</pre>
<p>
enable_pml作为一个模块参数，默认为1：
</p>
<pre class="example" id="orge3438d4">
bool __read_mostly enable_pml = 1;
module_param_named(pml, enable_pml, bool, S_IRUGO);
</pre>
<p>
根据intel虚拟化手册PML_ADDRESS就是vmcs里用来保存pml buffer地址的寄存器：
</p>
<pre class="example" id="orge8591ad">
enum vmcs_field {
    ...
	PML_ADDRESS			= 0x0000200e,
	...
};
</pre>
<p>
page_to_phys是将一个页面转换成物理地址，cpu访问pml address地址时不需要经过mmu，直接拿着物理地址往内存硬件单元上发送，而pml_pg同样在vmx_create_vcpu的初始化流程里分配：
</p>
<pre class="example" id="orga28d60f">
if (enable_pml) {
	vmx-&gt;pml_pg = alloc_page(GFP_KERNEL_ACCOUNT | __GFP_ZERO);
	if (!vmx-&gt;pml_pg)
		goto free_vpid;
}
</pre>
<p>
根据intel虚拟化手册，pml log buffer是由512个64-bit的条目组成的，所以使用alloc_page分配一页空间就行．然后使用vmcs_write64写入到vmcs的PML_ADDRSS字段即硬件上生效．根据intel虚拟化手册，pml功能还有一个pml index的vmcs字段，它控制了现在可以写pml buffer的哪个条目，它从511递减到0，然后就会产生一个page-modification log-full event导致虚拟机退出：
</p>
<pre class="example" id="org9e0a32b">
enum vmcs_field {	
	...
	GUEST_PML_INDEX			= 0x00000812,
	...
};
</pre>
<pre class="example" id="org5febb63">
#define PML_ENTITY_NUM		512
</pre>
<p>
可以看到GUEST_PML_INDEX通过vmcs_write16被初始化最大值511．
当前面小节介绍的enable pml bit打开，pml address以及pml index都设置好后，cpu硬件在每次访问GPA时，都会记录下来这次访问到pml buffer．
当虚拟机因为page-modification log-full event退出时，就会产生vm exit，这会退到宿主机（kvm）里有先有统一的接口去处理：__vmx_handle_exit，page-modification log-full event在kvm里其实是有专门的处理函数的，叫handle_pml_full，只是这个函数较为简单，并没有保存pml buffer里的脏信息到内存别处的动作．保存的动作另在如下路径：
</p>
<pre class="example" id="org955bba3">
__vmx_handle_exit-&gt;vmx_flush_pml_buffer
</pre>
<p>
换言之，只要有虚拟机退出，就会做一下pm buffer同步的事情（这当然也包括page-modification log-full event引起的vm exit），后面会有代码看到，软件正是利用了这个特点，可以主动kick cpu一次调度而引起vm exit，从而调用一次vmx_flush_pml_buffer来同步pml buffer．
</p>

<p>
现在看下vmx_flush_pml_buffer：
</p>
<pre class="example" id="org65ea56f">
static void vmx_flush_pml_buffer(struct kvm_vcpu *vcpu)
{
	struct vcpu_vmx *vmx = to_vmx(vcpu);
	u64 *pml_buf;
	u16 pml_idx;

	pml_idx = vmcs_read16(GUEST_PML_INDEX);

	/* Do nothing if PML buffer is empty */
	if (pml_idx == (PML_ENTITY_NUM - 1))
		return;

	/* PML index always points to next available PML buffer entity */
	if (pml_idx &gt;= PML_ENTITY_NUM)
		pml_idx = 0;
	else
		pml_idx++;

	pml_buf = page_address(vmx-&gt;pml_pg);
	for (; pml_idx &lt; PML_ENTITY_NUM; pml_idx++) {
		u64 gpa;

		gpa = pml_buf[pml_idx];
		WARN_ON(gpa &amp; (PAGE_SIZE - 1));
		kvm_vcpu_mark_page_dirty(vcpu, gpa &gt;&gt; PAGE_SHIFT);
	}

	/* reset PML index */
	vmcs_write16(GUEST_PML_INDEX, PML_ENTITY_NUM - 1);
}
</pre>
<p>
首先从vmcs的GUEST_PML_INDEX字段读出了当前的pml index指向哪个条目，pml_buf相当于又拿到pml page的虚拟地址，因为现在软件访问pml页面需要经过mmu，必须以虚拟地址的形式．注意for循环是从当前的pml index往高处的pml entry去遍历，因为根据intel虚拟化手册，硬件写脏页条目信息到pml buffer是从最高的511个条目往下写的．for循环里比较关键的是调用kvm_vcpu_mark_page_dirty保存脏页信息，其第一个参数vcpu其实就是当前引起vm exit的vcpu，而第二个参数是当前要记录的gpa，它左移了一个页面的大小，就是说对一个页面内的访问（任何字节）的访问都将只占据一个pml entry条目，这可以节省pml page的大小．vmx_flush_pml_buffer的最后reset了pml index，这样硬件又可以重复使用pml entry存储未来guest对GPA的访问了．
</p>

<p>
继续往下分析kvm_vcpu_mark_page_dirty：
</p>
<pre class="example" id="org99748fb">
void kvm_vcpu_mark_page_dirty(struct kvm_vcpu *vcpu, gfn_t gfn)
{
	struct kvm_memory_slot *memslot;

	memslot = kvm_vcpu_gfn_to_memslot(vcpu, gfn);
	mark_page_dirty_in_slot(vcpu-&gt;kvm, memslot, gfn);
}
</pre>
<p>
kvm_vcpu_gfn_to_memslot就不展示它的代码进行详细的分析了，总结来说，所有的gfn都由一个个的kvm_memory_slot去管理，里面记录了一个kvm_memory_slot的起始base_gfn，管理的多少页面npages，同时这段gfn的脏信息就存在dirty_bitmap，只不过使用kvm_memory_slot:dirty_bitmap来存储脏页信息已经不是较新的qemu 6.2的方式了．kvm_vcpu_gfn_to_memslot函数主要是通过gfn采用二分搜索的办法，去找到这个gfn被哪个kvm_memory_slot所管理．
</p>

<p>
kvm_vcpu_gfn_to_memslot-&gt;search_memslots-&gt;try_get_memslot函数里有个预防侧信道攻击的接口这里可以简单提下：
</p>
<pre class="example" id="org186fd62">
/*
 * slot_index can come from vcpu-&gt;last_used_slot which is not kept
 * in sync with userspace-controllable memslot deletion. So use nospec
 * to prevent the CPU from speculating past the end of memslots[].
 */
slot_index = array_index_nospec(slot_index, slots-&gt;used_slots);
slot = &amp;slots-&gt;memslots[slot_index];
</pre>
<p>
通过array_index_nospec将数组索引slot_index钳制（clamp）在o-size之间，这样后续使用这个索引访问数组内容时，不会出现越界问题．array_index_nospec返回的slot_index和后面使用这个slot_index去访问数组内容，人为构造了数据依赖，这样现代cpu不会因为乱序/推测执行而先用了未经clamp的索引去访问数组，这种方式比内存屏障会轻量一些．
</p>

<p>
继续分析mark_page_dirty_in_slot函数：
</p>
<pre class="example" id="org9640bed">
void mark_page_dirty_in_slot(struct kvm *kvm,
			     struct kvm_memory_slot *memslot,
		 	     gfn_t gfn)
{
	if (memslot &amp;&amp; kvm_slot_dirty_track_enabled(memslot)) {
		unsigned long rel_gfn = gfn - memslot-&gt;base_gfn;
		u32 slot = (memslot-&gt;as_id &lt;&lt; 16) | memslot-&gt;id;

		if (kvm-&gt;dirty_ring_size)
			kvm_dirty_ring_push(kvm_dirty_ring_get(kvm),
					    slot, rel_gfn);
		else
			set_bit_le(rel_gfn, memslot-&gt;dirty_bitmap);
	}
}
</pre>
<p>
kvm_slot_dirty_track_enabled会检查前面的节提到过的KVM_MEM_LOG_DIRTY_PAGES标志．
</p>

<p>
从这个函数就可以看到脏页信息可以有两种方式去保存一种是脏页环形缓冲区，一种是脏页位图．先简单介绍下脏页位图，因为较新的qemu版本已经很少使用这种低效率的方式了．首先在mark_page_dirty_in_slot这里的函数可以看到，rel_gfn是相对于当前kvm_memory_slot:base_gfn的相对偏移gfn，也就是说kvm_memory_slot:dirty_bitmap只是记录当前memslot的脏页信息，这通过set_bit_le置上相应的bit位即可．
</p>

<p>
针对kvm_memory_slot:dirty_bitmap的方式，内核kvm侧提供一个ioctl接口，用来同步内核侧的脏页信息到用户态qemu：
</p>
<pre class="example" id="org71b5bde">
static long kvm_vm_ioctl(struct file *filp,
			   unsigned int ioctl, unsigned long arg)
{
  ...
	case KVM_GET_DIRTY_LOG: {
		struct kvm_dirty_log log;

		r = -EFAULT;
		if (copy_from_user(&amp;log, argp, sizeof(log)))
			goto out;
		r = kvm_vm_ioctl_get_dirty_log(kvm, &amp;log);
		break;
	}
  ...
}
</pre>
<p>
然后在kvm_vm_ioctl_get_dirty_log-&gt;kvm_get_dirty_log_protect里有：
</p>
<pre class="example" id="org3d29bc4">
static int kvm_get_dirty_log_protect(struct kvm *kvm, struct kvm_dirty_log *log)
{
    ...
	unsigned long *dirty_bitmap;
	...
	dirty_bitmap = memslot-&gt;dirty_bitmap;
	...
	} else {
		dirty_bitmap_buffer = kvm_second_dirty_bitmap(memslot);
		memset(dirty_bitmap_buffer, 0, n);

		KVM_MMU_LOCK(kvm);
		for (i = 0; i &lt; n / sizeof(long); i++) {
			unsigned long mask;
			gfn_t offset;

			if (!dirty_bitmap[i])
				continue;

			flush = true;
			mask = xchg(&amp;dirty_bitmap[i], 0);
			dirty_bitmap_buffer[i] = mask;

			offset = i * BITS_PER_LONG;
			kvm_arch_mmu_enable_log_dirty_pt_masked(kvm, memslot,
								offset, mask);
		}
		KVM_MMU_UNLOCK(kvm);
	}

	if (flush)
		kvm_arch_flush_remote_tlbs_memslot(kvm, memslot);

	if (copy_to_user(log-&gt;dirty_bitmap, dirty_bitmap_buffer, n))
	...
}
</pre>
<p>
从这段代码可以很清楚的看到，kvm_memory_slot:dirty_bitmap先是被xchg到一个dirty_bitmap_buffer，然后又将它copy_to_user空间，这也就是前面提到的，使用dirty_bitmap方式效率较低，因为这种方式存在内核态/用户态拷贝．
</p>

<p>
下面重点介绍脏页环形缓冲区的方式．
</p>

<p>
dirty ring功能涉及qemu/kvm的配合，qemu侧的支持在下一节去介绍．内核kvm侧通过如下的补丁引入了对dirty ring的基本支持：
</p>
<pre class="example" id="org030beb1">
fb04a1eddb1a65b6588a021bdc132270d5ae48bb 最早在v5.11引入
</pre>
<p>
我们的内核在372引入了这个功能，147没有．
</p>

<p>
如果qemu侧支持dirty ring的功能（具体见下节），那么就可以发起KVM_CAP_DIRTY_LOG_RING的ioctl，这个ioctl cmd的处理函数是kvm_vm_ioctl_enable_dirty_log_ring：
</p>
<pre class="example" id="org2e9743f">
static int kvm_vm_ioctl_enable_cap_generic(struct kvm *kvm,
					   struct kvm_enable_cap *cap)
{
    ...
	case KVM_CAP_DIRTY_LOG_RING:
		return kvm_vm_ioctl_enable_dirty_log_ring(kvm, cap-&gt;args[0]);
    ...
}
</pre>
<p>
而在kvm_vm_ioctl_enable_dirty_log_ring函数里，会设置kvm:dirty_ring_size：
</p>
<pre class="example" id="orga932ef8">
static int kvm_vm_ioctl_enable_dirty_log_ring(struct kvm *kvm, u32 size)
{
    ...
	} else {
		kvm-&gt;dirty_ring_size = size;
		r = 0;
	}
    ...
}
</pre>
<p>
size是qemu用户态传来的，当size大于0时，就相当于是开启了内核的dirty ring功能，同时在kvm_vm_ioctl_enable_dirty_log_ring函数里会有判断传进来的size最大为KVM_DIRTY_RING_MAX_ENTRIES(65536)，在前面的mark_page_dirty_in_slot函数里正是利用了kvm:dirty_ring_size来作为判断条件看是否走kvm_dirty_ring_push函数这种dirty ring的方式记录脏页．
</p>

<p>
现在回到mark_page_dirty_in_slot继续往下分析内核kvm侧的脏页记录（dirty ring方式），先看一个获取kvm_dirty_ring的辅助函数：
</p>
<pre class="example" id="orgb376c28">
struct kvm_dirty_ring *kvm_dirty_ring_get(struct kvm *kvm)
{
	struct kvm_vcpu *vcpu = kvm_get_running_vcpu();

	WARN_ON_ONCE(vcpu-&gt;kvm != kvm);

	return &amp;vcpu-&gt;dirty_ring;
}
struct kvm_vcpu *kvm_get_running_vcpu(void)
{
	struct kvm_vcpu *vcpu;

	preempt_disable();
	vcpu = __this_cpu_read(kvm_running_vcpu);
	preempt_enable();

	return vcpu;
}
</pre>
<p>
可以看到kvm_dirty_ring是per-vcpu的，也就是每个vcpu都有一个dirty ring，同时pcp变量kvm_running_vcpu记录了当前物理cpu上运行的是哪个vcpu．继续往下看mark_page_dirty_in_slot调用的kvm_dirty_ring_push：
</p>
<pre class="example" id="org346d47d">
void kvm_dirty_ring_push(struct kvm_dirty_ring *ring, u32 slot, u64 offset)
{
	struct kvm_dirty_gfn *entry;

	/* It should never get full */
	WARN_ON_ONCE(kvm_dirty_ring_full(ring));

	entry = &amp;ring-&gt;dirty_gfns[ring-&gt;dirty_index &amp; (ring-&gt;size - 1)];

	entry-&gt;slot = slot;
	entry-&gt;offset = offset;
	/*
	 * Make sure the data is filled in before we publish this to
	 * the userspace program.  There's no paired kernel-side reader.
	 */
	smp_wmb();
	kvm_dirty_gfn_set_dirtied(entry);
	ring-&gt;dirty_index++;
	trace_kvm_dirty_ring_push(ring, slot, offset);
}
</pre>
<p>
先从dirty_gfns里拿出kvm_dirty_gfn，这个结构体内核/qemu都可以解释其格式，后面会介绍是因为dirty_gfns正是在内核空间和qemu用户空间共享的内存．kvm_dirty_gfn其实就是描述了guest访问某个gfn时关于脏信息的集合．前面分析父函数mark_page_dirty_in_slot时，知道offset其实是相对于当前gfn所在的kvm_memory_slot的base_gfn，同时slot号由kvm_memory_slot:as_id以及kvm_memory_slot:id两部分组成形成该gfn所属的槽号，也会记录到kvm_dirty_gfn里．kvm_dirty_ring_push里另一个调用的关键函数是kvm_dirty_gfn_set_dirtied：
</p>
<pre class="example" id="orgf030928">
static inline void kvm_dirty_gfn_set_dirtied(struct kvm_dirty_gfn *gfn)
{
	gfn-&gt;flags = KVM_DIRTY_GFN_F_DIRTY;
}
</pre>
<p>
这里其实是设置了当前gfn的状态，表示写脏了，guest刚访问过，KVM_DIRTY_GFN_F_DIRTY就代表gfn的一种dirty状态，这里涉及到gfn状态变化的一个简单状态机，直接引用内核代码的注释：
</p>
<pre class="example" id="orgac989d8">
/*
 * KVM dirty GFN flags, defined as:
 *
 * |---------------+---------------+--------------|
 * | bit 1 (reset) | bit 0 (dirty) | Status       |
 * |---------------+---------------+--------------|
 * |             0 |             0 | Invalid GFN  |
 * |             0 |             1 | Dirty GFN    |
 * |             1 |             X | GFN to reset |
 * |---------------+---------------+--------------|
 *
 * Lifecycle of a dirty GFN goes like:
 *
 *      dirtied         harvested        reset
 * 00 -----------&gt; 01 -------------&gt; 1X -------+
 *  ^                                          |
 *  |                                          |
 *  +------------------------------------------+
 *
 * The userspace program is only responsible for the 01-&gt;1X state
 * conversion after harvesting an entry.  Also, it must not skip any
 * dirty bits, so that dirty bits are always harvested in sequence.
 */
#define KVM_DIRTY_GFN_F_DIRTY           _BITUL(0)
#define KVM_DIRTY_GFN_F_RESET           _BITUL(1)
#define KVM_DIRTY_GFN_F_MASK            0x3
</pre>
<p>
也就是说guest访问过的gfn，由内核kvm置脏（因为内核通过PML硬件机制首先知道了哪些gfn被访问过），然后由qemu userspace去harvested，说白了这里其实就有一个生产者－消费者模型，内核记录脏页，由qemu（具体的就是live migration相关的代码）去消费．当qemu消费（harvested）了脏页信息，又需要推进状态机，变kvm_dirty_gfn:flags为KVM_DIRTY_GFN_F_RESET．前面介绍的其实都是直接使用kvm_dirty_gfn的空间了，但是关于其来源（分配）并没有分析，现在分析这点．
</p>

<p>
在创建vcpu时，就会检查kvm_vcpu:dirty_ring_size是否有值，如果有值，就会调用kvm_dirty_ring_alloc分配kvm_dirty_ring:dirty_gfns的空间：
</p>
<pre class="example" id="org723c2f0">
static int kvm_vm_ioctl_create_vcpu(struct kvm *kvm, u32 id)
{
    ...
	if (kvm-&gt;dirty_ring_size) {
		r = kvm_dirty_ring_alloc(&amp;vcpu-&gt;dirty_ring,
					 id, kvm-&gt;dirty_ring_size);
		if (r)
			goto arch_vcpu_destroy;
	}
	...
}
</pre>
<pre class="example" id="orgce234e1">
int kvm_dirty_ring_alloc(struct kvm_dirty_ring *ring, int index, u32 size)
{
	ring-&gt;dirty_gfns = vzalloc(size);
	if (!ring-&gt;dirty_gfns)
		return -ENOMEM;

	ring-&gt;size = size / sizeof(struct kvm_dirty_gfn);
	ring-&gt;soft_limit = ring-&gt;size - kvm_dirty_ring_get_rsvd_entries();
	ring-&gt;dirty_index = 0;
	ring-&gt;reset_index = 0;
	ring-&gt;index = index;

	return 0;
}
</pre>
<p>
以上就是kvm侧使用dirty ring对于脏页记录/处理的流程．
</p>
</div>
</div>
