kernel/virt/live-migration.html

<div id="outline-container-org137e839" class="outline-3">
<h3 id="org137e839"><span class="section-number-3">1.5.</span> qemu侧记录/获取脏页流程</h3>
<div class="outline-text-3" id="text-1-5">
<p>
qemu侧对于dirty ring的支持，主要涉及下面一些补丁：
</p>
<pre class="example" id="org06c0b25">
b4420f198dd8eab53cf6062c1871d0e5f5601e86 涉及dirty ring的基本支持 v6.1.0-rc0
2ea5cb0a47c9dbf78235de30a0d5846a4ab6d995 涉及dirty-ring-size参数接口方面的代码 v6.1.0-rc0
856e23a0fb92b0949eace7f43a521e0214246735 针对arm架构有一些微调 v8.1.0-rc0
</pre>
<p>
在上节介绍kvm侧时，提到了用户态kvm要传入大于0的size，内核态kvm才会开启dirty ring功能．这在qemu的kvm_init函数中有所体现：
</p>
<pre class="example" id="orgc700a58">
if (s-&gt;kvm_dirty_ring_size &gt; 0) {
     uint64_t ring_bytes;

     ring_bytes = s-&gt;kvm_dirty_ring_size * sizeof(struct kvm_dirty_gfn);

     /* Read the max supported pages */
     ret = kvm_vm_check_extension(s, KVM_CAP_DIRTY_LOG_RING);
     if (ret &gt; 0) {
         if (ring_bytes &gt; ret) {
             error_report("KVM dirty ring size %" PRIu32 " too big "
                          "(maximum is %ld).  Please use a smaller value.",
                          s-&gt;kvm_dirty_ring_size,
                          (long)ret / sizeof(struct kvm_dirty_gfn));
             ret = -EINVAL;
             goto err;
         }

         ret = kvm_vm_enable_cap(s, KVM_CAP_DIRTY_LOG_RING, 0, ring_bytes);
         if (ret) {
             error_report("Enabling of KVM dirty ring failed: %s. "
                          "Suggested minimum value is 1024.", strerror(-ret));
             goto err;
         }

         s-&gt;kvm_dirty_ring_bytes = ring_bytes;
      } else {
          warn_report("KVM dirty ring not available, using bitmap method");
          s-&gt;kvm_dirty_ring_size = 0;
     }
 }
</pre>
<p>
这里就可以看到使用KVM_CAP_DIRTY_LOG_RING cmd去调用ioctl，到了kvm就可以设置kvm:dirty_ring_size非0，这样内核态kvm相关的dirty ring的逻辑就可以运行起来．这里可以看到要想通过kvm_vm_enable_cap的KVM_CAP_DIRTY_LOG_RING到内核里去设置kvm:dirty_ring_size为非0，实际上是有两个条件，一是KVMState:kvm_dirty_ring_size要大于0，二是以KVM_CAP_DIRTY_LOG_RING cmd调用的kvm_vm_check_extension要大于0，这其实是从两个角度共同控制是否使用dirty ring功能．先说第一个条件，这是qemu（以及kvm）开给用户的选项能力控制dirty ring的开启．KVMState:kvm_dirty_ring_size在函数kvm_set_dirty_ring_size设置：
</p>
<pre class="example" id="org7e37a1e">
static void kvm_set_dirty_ring_size(Object *obj, Visitor *v,
                                    const char *name, void *opaque,
                                    Error **errp)
{
    ...
    s-&gt;kvm_dirty_ring_size = value;
}
</pre>
<p>
kvm_set_dirty_ring_size作为dirty-ring-size这个属性的set函数被添加到ObjectClass:properties这个hash表里，在初始化的时候调用：
</p>
<pre class="example" id="orgf9818ae">
static void kvm_accel_class_init(ObjectClass *oc, void *data)
{
    ...
    object_class_property_add(oc, "dirty-ring-size", "uint32",
        kvm_get_dirty_ring_size, kvm_set_dirty_ring_size,
        NULL, NULL);
    ...
}
</pre>
<p>
在介绍qemu选项的代码中（文件qemu-options.hx）可以看到如下对dirty-ring-size描述：
</p>
<pre class="example" id="orgacae1d6">
``dirty-ring-size=n``
     When the KVM accelerator is used, it controls the size of the per-vCPU
     dirty page ring buffer (number of entries for each vCPU). It should
     be a value that is power of two, and it should be 1024 or bigger (but
     still less than the maximum value that the kernel supports).  4096
     could be a good initial value if you have no idea which is the best.
     Set this value to 0 to disable the feature.  By default, this feature
     is disabled (dirty-ring-size=0).  When enabled, KVM will instead
     record dirty pages in a bitmap.
</pre>
<p>
可以看到，要想使能dirty ring功能，必须将dirty-ring-size设置为非0，一种典型的设置：-accel kvm,dirty-ring-size=4096，目前找了个环境看了下没有显式的设置这个参数，所以目前621环境是没有使用起这个功能的．下面分析第二个控制开启dirty ring的选项：以KVM_CAP_DIRTY_LOG_RING cmd调用kvm_vm_check_extension要大于0．在kvm内核侧这个cmd的实现如下，实际是返回了内核目前支持的最大kvm_dirty_gfn条目数：
</p>
<pre class="example" id="orgfd82acb">
#if KVM_DIRTY_LOG_PAGE_OFFSET &gt; 0
		return KVM_DIRTY_RING_MAX_ENTRIES * sizeof(struct kvm_dirty_gfn);
#else
		return 0;
</pre>
<pre class="example" id="orgac28e93">
/*
 * Arch needs to define the macro after implementing the dirty ring
 * feature.  KVM_DIRTY_LOG_PAGE_OFFSET should be defined as the
 * starting page offset of the dirty ring structures.
 */
#ifndef KVM_DIRTY_LOG_PAGE_OFFSET
#define KVM_DIRTY_LOG_PAGE_OFFSET 0
#endif
</pre>
<p>
可以看到，arch要是支持了dirty ring功能，就会将KVM_DIRTY_LOG_PAGE_OFFSET设置为非0，比如x86将其实现为64．而arm64没有将其定义为大于0的值，而是使用include/uapi/linux/kvm.h里的默认值0，所以621的代码要想支持arm64的dirty ring，需要backport一些代码．这个宏其作用其实是将dirty ring从内核空间映射到用户态空间的偏移．
</p>

<p>
介绍完qemu侧对dirty ring开启的控制后，可以分析下qemu侧怎么记录/获取脏页的．
</p>

<p>
qemu里传统的采用dirty_bmap的方式是通过以下代码链完成从内核侧获取脏页信息到qemu用户态：
</p>
<pre class="example" id="orgdcbf158">
kvm_log_sync-&gt;kvm_physical_sync_dirty_bitmap-&gt;kvm_slot_get_dirty_log-&gt;kvm_vm_ioctl
</pre>

<p>
最后的kvm_slot_get_dirty_log实现如下：
</p>
<pre class="example" id="org7ab48f4">
static bool kvm_slot_get_dirty_log(KVMState *s, KVMSlot *slot)
{
    struct kvm_dirty_log d = {};
    int ret;

    d.dirty_bitmap = slot-&gt;dirty_bmap;
    d.slot = slot-&gt;slot | (slot-&gt;as_id &lt;&lt; 16);
    ret = kvm_vm_ioctl(s, KVM_GET_DIRTY_LOG, &amp;d);

    if (ret == -ENOENT) {
        /* kernel does not have dirty bitmap in this slot */
        ret = 0;
    }
    if (ret) {
        error_report_once("%s: KVM_GET_DIRTY_LOG failed with %d",
                          __func__, ret);
    }
    return ret == 0;
}
</pre>
<p>
使用KVM_GET_DIRTY_LOG这个命令调用到内核里，在内核里的处理，前面已经介绍过了．
</p>

<p>
上面简单介绍了下传统的dirty_bmap方式，下面主要还是介绍dirty ring的方式，这种方式在qemu的代码里通过以下调用链完成日志收集：
</p>

<pre class="example" id="org9dd61b3">
kvm_log_sync_global-&gt;kvm_dirty_ring_flush-&gt;kvm_dirty_ring_reap-&gt;kvm_dirty_ring_reap_locked-&gt;kvm_dirty_ring_reap_one-&gt;kvm_dirty_ring_mark_page
</pre>

<p>
从kvm_log_sync_global再往上，qemu有两种手段/途径去同步内核的脏页信息，一种是在热迁移路径里现做，这种路径是kvm_log_sync_global作为log_sync_global回调函数而被调用，前面dirty bitmap的方式，使用函数kvm_log_sync其实也是作为log_sync回调函数而使用的，这两个回调钩子在如下函数代码里初始化：
</p>

<pre class="example" id="orgb9379e6">
void kvm_memory_listener_register(KVMState *s, KVMMemoryListener *kml,
                                  AddressSpace *as, int as_id, const char *name)
{
    ...
    if (s-&gt;kvm_dirty_ring_size) {
        kml-&gt;listener.log_sync_global = kvm_log_sync_global;
    } else {
        kml-&gt;listener.log_sync = kvm_log_sync;
        kml-&gt;listener.log_clear = kvm_log_clear;
    }
    ...
}
</pre>
<p>
在这里也可以很清楚的看到，dirty bitmap和dirty ring在qemu的代码里走了不同的路径，kvm_dirty_ring_size怎么设置的前面已经详细分析过了．
</p>

<p>
dirty ring的第一种方式同步内核脏页信息是热迁移现做，这种方式的一个路径比如如下：
</p>

<pre class="example" id="orgb329bf8">
ram_init_bitmaps-&gt;migration_bitmap_sync_precopy-&gt;migration_bitmap_sync-&gt;memory_global_dirty_log_sync-&gt;
memory_region_sync_dirty_bitmap-&gt;log_sync_global(kvm_log_sync_global)-&gt;kvm_dirty_ring_flush-&gt;
kvm_dirty_ring_reap-&gt;kvm_dirty_ring_reap_locked-&gt;kvm_dirty_ring_reap_one-&gt;kvm_dirty_ring_mark_page
</pre>

<p>
对于上面的函数调用链，这里介绍两点，一是ram_init_bitmaps函数里是先调用了memory_global_dirty_log_start再调用migration_bitmap_sync_precopy，也就是热迁移一开启脏页迁移后就做了一次从内核获取脏页信息的动作：
</p>

<pre class="example" id="orge6a90e7">
static void ram_init_bitmaps(RAMState *rs)
{
  ...
        if (!migrate_background_snapshot()) {
            memory_global_dirty_log_start(GLOBAL_DIRTY_MIGRATION);
            migration_bitmap_sync_precopy(rs);
        }
  ...
}
</pre>

<p>
第二点是memory_region_sync_dirty_bitmap函数，这个函数屏蔽了dirty_bitmap和dirty ring方式的差异，从它向上的父函数是不知道底层这两种不同的实现方式的：
</p>
<pre class="example" id="orgbfeae9b">
static void memory_region_sync_dirty_bitmap(MemoryRegion *mr)
{
        if (listener-&gt;log_sync) {
            ...
            listener-&gt;log_sync(listener, &amp;mrs);//dirty_bitmap方式，kvm_log_sync
            ...
        } else if (listener-&gt;log_sync_global) {
            ...
            listener-&gt;log_sync_global(listener); //dirty ring方式，kvm_log_sync_global
            ...
        }
 }
</pre>
<p>
dirty ring的第二种同步内核脏页信息的方式是通过一个线程在后台每隔1s做一次：
</p>
<pre class="example" id="org2e0a577">
kvm_dirty_ring_reaper_thread-&gt;
kvm_dirty_ring_reap-&gt;kvm_dirty_ring_reap_locked-&gt;kvm_dirty_ring_reap_one-&gt;kvm_dirty_ring_mark_page
</pre>
<p>
上面的调用链第二行和前面的第一种同步脏页信息的路径最后一行是一样的，只有最前面的kvm_dirty_ring_reaper_thread这时是通过创建一个线程来做同步：
</p>
<pre class="example" id="orgea9cd48">
static int kvm_dirty_ring_reaper_init(KVMState *s)
{
    struct KVMDirtyRingReaper *r = &amp;s-&gt;reaper;

    qemu_thread_create(&amp;r-&gt;reaper_thr, "kvm-reaper",
                       kvm_dirty_ring_reaper_thread,
                       s, QEMU_THREAD_JOINABLE);

    return 0;
}

static void *kvm_dirty_ring_reaper_thread(void *data)
{
      ...
      while (true) {
        r-&gt;reaper_state = KVM_DIRTY_RING_REAPER_WAIT;
        trace_kvm_dirty_ring_reaper("wait");
        /*
         * TODO: provide a smarter timeout rather than a constant?
         */
        sleep(1);

        trace_kvm_dirty_ring_reaper("wakeup");
        r-&gt;reaper_state = KVM_DIRTY_RING_REAPER_REAPING;

        qemu_mutex_lock_iothread();
        kvm_dirty_ring_reap(s);
        qemu_mutex_unlock_iothread();

        r-&gt;reaper_iteration++;
    }
    ...
}
</pre>
<p>
可以看到这个后台定期1s同步脏页信息的线程叫kvm-reaper．
</p>

<p>
分析完了qemu使用dirty ring的两种同步脏页信息的路径，下面可以具体看下qemu将脏页信息又搬到了哪里，先看kvm_dirty_ring_reap_one函数：
</p>

<pre class="example" id="org3dfe89d">
static uint32_t kvm_dirty_ring_reap_one(KVMState *s, CPUState *cpu)
{
    struct kvm_dirty_gfn *dirty_gfns = cpu-&gt;kvm_dirty_gfns, *cur;
    uint32_t ring_size = s-&gt;kvm_dirty_ring_size;
    uint32_t count = 0, fetch = cpu-&gt;kvm_fetch_index;

    assert(dirty_gfns &amp;&amp; ring_size);
    trace_kvm_dirty_ring_reap_vcpu(cpu-&gt;cpu_index);

    while (true) {
        cur = &amp;dirty_gfns[fetch % ring_size];
        if (!dirty_gfn_is_dirtied(cur)) {
            break;
        }
        kvm_dirty_ring_mark_page(s, cur-&gt;slot &gt;&gt; 16, cur-&gt;slot &amp; 0xffff,
                                 cur-&gt;offset);
        dirty_gfn_set_collected(cur);
        trace_kvm_dirty_ring_page(cpu-&gt;cpu_index, fetch, cur-&gt;offset);
        fetch++;
        count++;
    }
    cpu-&gt;kvm_fetch_index = fetch;
    cpu-&gt;dirty_pages += count;

    return count;
}
</pre>

<p>
这个函数从CPUState:kvm_dirty_gfns里取出脏页信息，kvm_dirty_gfn前面的分析提到过，它是内核和qemu都认识的一个结构体，然后在while循环里针对所有设置了KVM_DIRTY_GFN_F_DIRTY标志的kvm_dirty_gfn去调用kvm_dirty_ring_mark_page函数：
</p>

<pre class="example" id="org3b6d884">
static bool dirty_gfn_is_dirtied(struct kvm_dirty_gfn *gfn)
{
    return gfn-&gt;flags == KVM_DIRTY_GFN_F_DIRTY;
}
</pre>
<p>
kvm_dirty_ring_mark_page函数里将脏页信息又转移到了KVMSlot:dirty_bmap：
</p>
<pre class="example" id="orgc3459ef">
static void kvm_dirty_ring_mark_page(KVMState *s, uint32_t as_id,
                                     uint32_t slot_id, uint64_t offset)
{
    KVMMemoryListener *kml;
    KVMSlot *mem;

    if (as_id &gt;= s-&gt;nr_as) {
        return;
    }

    kml = s-&gt;as[as_id].ml;
    mem = &amp;kml-&gt;slots[slot_id];

    if (!mem-&gt;memory_size || offset &gt;=
        (mem-&gt;memory_size / qemu_real_host_page_size)) {
        return;
    }

    set_bit(offset, mem-&gt;dirty_bmap);
}
</pre>

<p>
先通过as_id找到AddressSpace，再通过slot_id找到是哪个KVMSlot，最后将KVMSlot:dirty_bmap对应offset的位置1，代表对应的这个页面被写过．kvm_dirty_ring_reap_one调用完kvm_dirty_ring_mark_page将脏信息转移到KVMSlot:dirty_bmap后，又调用dirty_gfn_set_collected将对应的kvm_dirty_gfn:flags设置为KVM_DIRTY_GFN_F_RESET，表示我qemu作为consumer，已经使用了脏页信息了，你kvm（内核）作为producer可以清除这个脏信息了，但是发起清除的这个请求由qemu来做，只是kvm执行这个动作，在kvm_dirty_ring_reap_one搜集转移了脏信息后，它的父函数kvm_dirty_ring_reap_locked就可以调用KVM_RESET_DIRTY_RINGS这个cmd的ioctl请求了：
</p>

<pre class="example" id="orgb1d0633">
static uint64_t kvm_dirty_ring_reap_locked(KVMState *s)
{
    ...
    CPU_FOREACH(cpu) {
        total += kvm_dirty_ring_reap_one(s, cpu);
    }

    if (total) {
        ret = kvm_vm_ioctl(s, KVM_RESET_DIRTY_RINGS);
        assert(ret == total);
    }
    ...
}
</pre>

<p>
在内核kvm侧，处理KVM_RESET_DIRTY_RINGS这个ioctl请求是kvm_vm_ioctl_reset_dirty_pages函数：
</p>
<pre class="example" id="orgfdcfe92">
static int kvm_vm_ioctl_reset_dirty_pages(struct kvm *kvm)
{
    ...
	kvm_for_each_vcpu(i, vcpu, kvm)
		cleared += kvm_dirty_ring_reset(vcpu-&gt;kvm, &amp;vcpu-&gt;dirty_ring);
	...
}
</pre>
<p>
而在kvm_dirty_ring_reset函数里会检查kvm_dirty_gfn:flags是否是KVM_DIRTY_GFN_F_RESET，如果是就调用kvm_dirty_gfn_set_invalid将kvm_dirty_gfn:flags设置为0，表示这个脏信息已经被用户态回收过了：
</p>

<pre class="example" id="org998e0e0">
int kvm_dirty_ring_reset(struct kvm *kvm, struct kvm_dirty_ring *ring)
{
    ...
	while (true) {
		entry = &amp;ring-&gt;dirty_gfns[ring-&gt;reset_index &amp; (ring-&gt;size - 1)];

		if (!kvm_dirty_gfn_harvested(entry))
			break;

		next_slot = READ_ONCE(entry-&gt;slot);
		next_offset = READ_ONCE(entry-&gt;offset);

		/* Update the flags to reflect that this GFN is reset */
		kvm_dirty_gfn_set_invalid(entry);
		...
	}
}

static inline void kvm_dirty_gfn_set_invalid(struct kvm_dirty_gfn *gfn)
{
	gfn-&gt;flags = 0;
}
</pre>

<p>
注意这里用户态/内核态的同步逻辑，内核侧写脏时，根据前面层的分析，其直接调用kvm_dirty_gfn_set_dirtied而没有判断之前的状态，因为之前无非就是非脏/脏两种，将非脏变成脏，正是记录了guest对gfn的访问，将脏变成脏也不会丢失脏信息没什么问题．而内核侧需要将flags变成0表示invalid状态时，需要检查其之前是不是KVM_DIRTY_GFN_F_RESET，这个flags的值只有用户态自己回收了脏信息，才会设置，这样避免脏信息丢失．这里也展示了前面层提到的简单状态机．
</p>

<p>
以上的分析都是说用户态直接拿来信息用便是，但是这个通路究竟怎么联系起来的，前面层分析传统的dirty_bitmap方式，有介绍到传统的方式是copy_to_user这种内核态/用户态间相互拷贝．但是dirty ring是mmap的方式，之前的层分析过了，kvm_dirty_ring:dirty_gfns是在内核虚拟空间通过vzalloc得到的，而在qemu里，创建完vcpu后通过kvm_init_vcpu初始化vcpu时，有以下代码：
</p>

<pre class="example" id="org4d4615d">
int kvm_init_vcpu(CPUState *cpu, Error **errp)
{
    ...
    if (s-&gt;kvm_dirty_ring_size) {
        /* Use MAP_SHARED to share pages with the kernel */
        cpu-&gt;kvm_dirty_gfns = mmap(NULL, s-&gt;kvm_dirty_ring_bytes,
                                   PROT_READ | PROT_WRITE, MAP_SHARED,
                                   cpu-&gt;kvm_fd,
                                   PAGE_SIZE * KVM_DIRTY_LOG_PAGE_OFFSET);
        if (cpu-&gt;kvm_dirty_gfns == MAP_FAILED) {
            ret = -errno;
            DPRINTF("mmap'ing vcpu dirty gfns failed: %d\n", ret);
            goto err;
        }
    }
    ...
}
</pre>

<p>
也就是说，用户态对cpu-&gt;kvm_fd所指的文件（代表了vcpu，内核抽象出来的fd供用户态操作vcpu）偏移PAGE_SIZE * KVM_DIRTY_LOG_PAGE_OFFSET处的内容映射到了其用户态虚拟空间．这个mmap函数会通过cpu-&gt;kvm_fd参数找到内核里对应这个文件fops即kvm_vcpu_fops：
</p>

<pre class="example" id="org4cfcde4">
static struct file_operations kvm_vcpu_fops = {
	.release        = kvm_vcpu_release,
	.unlocked_ioctl = kvm_vcpu_ioctl,
	.mmap           = kvm_vcpu_mmap,
	.llseek		= noop_llseek,
	KVM_COMPAT(kvm_vcpu_compat_ioctl),
};
</pre>

<p>
可以看到，这里设置了mmap回调为kvm_vcpu_mmap，通过如下调用链用户态的mmap系统调用最终会来到这个kvm_vcpu_mmap函数：
</p>

<pre class="example" id="orgc6da2d8">
SYSCALL_DEFINE6(mmap_pgoff...)-&gt;ksys_mmap_pgoff-&gt;vm_mmap_pgoff-&gt;do_mmap_pgoff-&gt;do_mmap-&gt;mmap_region-&gt;call_mmap: return file-&gt;f_op-&gt;mmap(file, vma);
</pre>
<p>
kvm_vcpu_mmap函数的逻辑很简单，在做了一些合法性判断后，就将vma的vm_ops设置为kvm_vcpu_vm_ops了，这个vm_ops里也很简单，只实现了fault回调函数为kvm_vcpu_fault：
</p>

<pre class="example" id="org2691ef5">
static const struct vm_operations_struct kvm_vcpu_vm_ops = {
	.fault = kvm_vcpu_fault,
};

static int kvm_vcpu_mmap(struct file *file, struct vm_area_struct *vma)
{
	struct kvm_vcpu *vcpu = file-&gt;private_data;
	unsigned long pages = (vma-&gt;vm_end - vma-&gt;vm_start) &gt;&gt; PAGE_SHIFT;

	if ((kvm_page_in_dirty_ring(vcpu-&gt;kvm, vma-&gt;vm_pgoff) ||
	     kvm_page_in_dirty_ring(vcpu-&gt;kvm, vma-&gt;vm_pgoff + pages - 1)) &amp;&amp;
	    ((vma-&gt;vm_flags &amp; VM_EXEC) || !(vma-&gt;vm_flags &amp; VM_SHARED)))
		return -EINVAL;

	vma-&gt;vm_ops = &amp;kvm_vcpu_vm_ops;
	return 0;
}
</pre>
<p>
然后用户态访问这个映射的dirty ring时缺页异常里有：
</p>
<pre class="example" id="org6c70775">
...-&gt;handle_mm_fault-&gt;__handle_mm_fault-&gt;handle_pte_fault-&gt;do_fault-&gt;do_read_fault-&gt;__do_fault: ret = vma-&gt;vm_ops-&gt;fault(vmf);
</pre>
<p>
最终会来到kvm_vcpu_fault这个fault函数，在这个函数里主要是判断访问的偏移落在了哪个范围，不同的范围得到不同的page，然后给到vmf-&gt;page，这样回到缺页的公共流程里，填充页表，下一次访问时就是dirty ring的内容了：
</p>

<pre class="example" id="orgc02d8b4">
static vm_fault_t kvm_vcpu_fault(struct vm_fault *vmf)
{
	struct kvm_vcpu *vcpu = vmf-&gt;vma-&gt;vm_file-&gt;private_data;
	struct page *page;

	if (vmf-&gt;pgoff == 0)
		page = virt_to_page(vcpu-&gt;run);
#ifdef CONFIG_X86
	else if (vmf-&gt;pgoff == KVM_PIO_PAGE_OFFSET)
		page = virt_to_page(vcpu-&gt;arch.pio_data);
#endif
#ifdef CONFIG_KVM_MMIO
	else if (vmf-&gt;pgoff == KVM_COALESCED_MMIO_PAGE_OFFSET)
		page = virt_to_page(vcpu-&gt;kvm-&gt;coalesced_mmio_ring);
#endif
	else if (kvm_page_in_dirty_ring(vcpu-&gt;kvm, vmf-&gt;pgoff))
		page = kvm_dirty_ring_get_page(
		    &amp;vcpu-&gt;dirty_ring,
		    vmf-&gt;pgoff - KVM_DIRTY_LOG_PAGE_OFFSET);
	else
		return kvm_arch_vcpu_fault(vcpu, vmf);
	get_page(page);
	vmf-&gt;page = page;
	return 0;
}
</pre>
<p>
注意最后的kvm_dirty_ring_get_page里使用了vmalloc_to_page，因为当时在kvm里分配这段空间时使用的就是vzalloc，属于内核的vmalloc虚拟空间．
</p>

<p>
在即将结束＂脏页跟踪机制＂这节时，最后想分析下qemu代码里脏页信息的流转过程，这个过程涉及到qemu里虚拟机热迁移的整体流程，从脏页信息流转的角度切入这个虚拟机热迁移过程，以为其它节介绍虚拟机热迁移开出一个引子．
</p>

<p>
在前面已经介绍到，内核的脏页信息在kvm_dirty_ring_reap_one-&gt;kvm_dirty_ring_mark_page这个函数里被转移到了KVMSlot:dirty_bmap里，其实这个流程是处于一个更长的虚拟机迁移流程里：
</p>

<pre class="example" id="orge6529ff">
migration_thread-&gt;migration_iteration_run-&gt;qemu_savevm_state_pending-&gt;save_live_pending(ram_save_pending)-&gt;migration_bitmap_sync_precopy
-&gt;migration_bitmap_sync-&gt;memory_global_dirty_log_sync-&gt;memory_region_sync_dirty_bitmap-&gt;log_sync_global(kvm_log_sync_global)
-&gt;kvm_dirty_ring_flush-&gt;kvm_dirty_ring_reap-&gt;kvm_dirty_ring_reap_locked-&gt;kvm_dirty_ring_reap_one-&gt;kvm_dirty_ring_mark_page
</pre>

<p>
从内核里拿到脏页信息并转移到KVMSlot:dirty_bmap：
</p>
<pre class="example" id="org5304974">
set_bit(offset, mem-&gt;dirty_bmap);
</pre>
<p>
后又有流程：
</p>
<pre class="example" id="orgedd20ba">
migration_thread-&gt;migration_iteration_run-&gt;qemu_savevm_state_pending-&gt;save_live_pending(ram_save_pending)-&gt;migration_bitmap_sync_precopy
-&gt;migration_bitmap_sync-&gt;memory_global_dirty_log_sync-&gt;memory_region_sync_dirty_bitmap-&gt;log_sync_global(kvm_log_sync_global)
-&gt;kvm_slot_sync_dirty_pages-&gt;cpu_physical_memory_set_dirty_lebitmap
</pre>

<p>
将脏页信息转移到了ram_list.dirty_memory全局脏页信息表里：
</p>
<pre class="example" id="orgd08fe28">
static inline void cpu_physical_memory_set_dirty_lebitmap(unsigned long *bitmap,
                                                          ram_addr_t start,
                                                          ram_addr_t pages)
{
            ...
            for (i = 0; i &lt; DIRTY_MEMORY_NUM; i++) {
                blocks[i] =
                    qatomic_rcu_read(&amp;ram_list.dirty_memory[i])-&gt;blocks;
            }

            for (k = 0; k &lt; nr; k++) {
                if (bitmap[k]) {
                    unsigned long temp = leul_to_cpu(bitmap[k]);

                    qatomic_or(&amp;blocks[DIRTY_MEMORY_VGA][idx][offset], temp);

                    if (global_dirty_tracking) {
                        qatomic_or(
                                &amp;blocks[DIRTY_MEMORY_MIGRATION][idx][offset],
                                temp);
                        if (unlikely(
                            global_dirty_tracking &amp; GLOBAL_DIRTY_DIRTY_RATE)) {
                            total_dirty_pages += ctpopl(temp);
                        }
                    }

                    if (tcg_enabled()) {
                        qatomic_or(&amp;blocks[DIRTY_MEMORY_CODE][idx][offset],
                                   temp);
                    }
                }
                ...
}
</pre>
<p>
随后又有流程：
</p>
<pre class="example" id="orga11586c">
migration_thread-&gt;migration_iteration_run-&gt;qemu_savevm_state_pending-&gt;save_live_pending(ram_save_pending)-&gt;migration_bitmap_sync_precopy
-&gt;migration_bitmap_sync-&gt;ramblock_sync_dirty_bitmap-&gt;cpu_physical_memory_sync_dirty_bitmap
</pre>
<p>
将上面全局的bitmap信息又转移到了每RAMBlock:bmap里：
</p>
<pre class="example" id="org0af4b63">
static inline
uint64_t cpu_physical_memory_sync_dirty_bitmap(RAMBlock *rb,
                                               ram_addr_t start,
                                               ram_addr_t length)
{
    ...
    unsigned long *dest = rb-&gt;bmap;
    ...
        src = qatomic_rcu_read(
                &amp;ram_list.dirty_memory[DIRTY_MEMORY_MIGRATION])-&gt;blocks;

        for (k = page; k &lt; page + nr; k++) {
            if (src[idx][offset]) {
                unsigned long bits = qatomic_xchg(&amp;src[idx][offset], 0);
                unsigned long new_dirty;
                new_dirty = ~dest[k];
                dest[k] |= bits;
                new_dirty &amp;= bits;
                num_dirty += ctpopl(new_dirty);
            }
    ...
}
</pre>
<p>
最后迁移发送内存的流程，使用的是最后的RAMBlock:bmap里的脏页信息，比如这样的一个路径：
</p>
<pre class="example" id="org467ddb5">
migration_thread-&gt;migration_iteration_run
-&gt;qemu_savevm_state_iterate-&gt;save_live_iterate(ram_save_iterate)-&gt;ram_find_and_save_block-&gt;find_dirty_block-&gt;migration_bitmap_find_dirty
</pre>
<p>
最后的migration_bitmap_find_dirty就是使用RAMBlock:bmap的信息来查询脏页信息，决定只发送脏页：
</p>
<pre class="example" id="org990fa71">
static inline
unsigned long migration_bitmap_find_dirty(RAMState *rs, RAMBlock *rb,
                                          unsigned long start)
{
    unsigned long size = rb-&gt;used_length &gt;&gt; TARGET_PAGE_BITS;
    unsigned long *bitmap = rb-&gt;bmap;

    if (ramblock_is_ignored(rb)) {
        return size;
    }

    return find_next_bit(bitmap, size, start);
}
</pre>
<p>
找到脏页后ram_find_and_save_block-&gt;ram_save_host_page函数去发送脏页面，这样整个脏页从内核态如何到用户态，用户态qemu又如何转移脏页信息，以及最后在哪里使用的就都清楚了．
</p>

<p>
以上就是＂脏页跟踪机制＂的全部流程，后续还要介绍qemu里虚拟机的迁移流程．
</p>
</div>
</div>
</div>
