kernel/virt/live-migration.html
<div id="outline-container-org6ad644e" class="outline-2">
<h2 id="org6ad644e"><span class="section-number-2">2.</span> 迁移第一阶段</h2>
<div class="outline-text-2" id="text-2">
<p>
前面的层有提到libvirt使用qmp方式使得dst端开启还原流程，那么在src端其实是类似的，libvrit的如下代码流程会使用migrate json命令使得qemu进入到发送虚拟机的流程里：
</p>
<pre class="example" id="org3e88dc9">
qemuMigrationSrcRun-&gt;qemuMigrationSrcStart-&gt;qemuMonitorMigrateToSocket-&gt;qemuMonitorJSONMigrate
</pre>
<p>
qemuMonitorJSONMigrate函数使用migrate串构造命令发送给qemu进程进行处理：
</p>
<pre class="example" id="orgfe976e8">
...
g_autoptr(virJSONValue) cmd = qemuMonitorJSONMakeCommand("migrate",
                                                         "b:detach", true,
                                                         "b:resume", resume,
                                                         "s:uri", uri,
                                                         NULL);

...
</pre>
<p>
前面介绍过，这个命令最后对应的qemu里的处理函数就是qmp_migrate．在qemu代码的qapi/migration.json文件里有关于这个命令的描述：
</p>
<pre class="example" id="org965e659">
##
# @migrate:
#
# Migrates the current running guest to another Virtual Machine.
#
# @uri: the Uniform Resource Identifier of the destination VM
#
# @blk: do block migration (full disk copy)
#
# @inc: incremental disk copy migration
#
# @detach: this argument exists only for compatibility reasons and
#          is ignored by QEMU
#
# @resume: resume one paused migration, default "off". (since 3.0)
#
# Returns: nothing on success
#
# Since: 0.14
#
# Notes:
#
# 1. The 'query-migrate' command should be used to check migration's progress
#    and final result (this information is provided by the 'status' member)
#
# 2. All boolean arguments default to false
#
# 3. The user Monitor's "detach" argument is invalid in QMP and should not
#    be used
#
# Example:
#
# -&gt; { "execute": "migrate", "arguments": { "uri": "tcp:0:4446" } }
# &lt;- { "return": {} }
#
##
{ 'command': 'migrate',
  'data': {'uri': 'str', '*blk': 'bool', '*inc': 'bool',
           '*detach': 'bool', '*resume': 'bool' } }
</pre>
<p>
从这个例子可以看到使用的是tcp的网络方式（uri参数会指明使用什么通道去传递虚拟机数据），那么在qmp_migrate里就会走socket网络的方式，其它方式还有rdma，本文主要关注tcp网络的方式．tcp网络方式就是qmp_migrate-&gt;socket_start_outgoing_migration：
</p>
<pre class="example" id="org555f169">
void qmp_migrate(const char *uri, bool has_blk, bool blk,
                 bool has_inc, bool inc, bool has_detach, bool detach,
                 bool has_resume, bool resume, Error **errp)
{
    ...
    if (strstart(uri, "tcp:", &amp;p) ||
        strstart(uri, "unix:", NULL) ||
        strstart(uri, "vsock:", NULL)) {
        migrate_protocol_allow_multifd(true);
        socket_start_outgoing_migration(s, p ? p : uri, &amp;local_err);
#ifdef CONFIG_RDMA
    } else if (strstart(uri, "rdma:", &amp;p)) {
        rdma_start_outgoing_migration(s, p, &amp;local_err);
#endif
    ...
}
</pre>
<p>
socket_start_outgoing_migration里就是简单的调用socket_start_outgoing_migration_internal，而在socket_start_outgoing_migration_internal函数里：
</p>
<pre class="example" id="orga7458fa">
socket_start_outgoing_migration_internal(MigrationState *s,
                                         SocketAddress *saddr,
                                         Error **errp)
{
    ...
    qio_channel_socket_connect_async(sioc,
                                     saddr,
                                     socket_outgoing_migration,
                                     data,
                                     socket_connect_data_free,
                                     NULL);

    ...
}
</pre>
<p>
可以看到socket_outgoing_migration是一个回调函数，它作为qio_channel_socket_connect_async函数调用的第三个参数，随着后面的分析，可以看到socket_outgoing_migration函数正是真正执行虚拟机发送的函数，继续看qio_channel_socket_connect_async函数：
</p>
<pre class="example" id="orgfd4785d">
void qio_channel_socket_connect_async(QIOChannelSocket *ioc,
                                      SocketAddress *addr,
                                      QIOTaskFunc callback,
                                      gpointer opaque,
                                      GDestroyNotify destroy,
                                      GMainContext *context)
{
    QIOTask *task = qio_task_new(
        OBJECT(ioc), callback, opaque, destroy);
    SocketAddress *addrCopy;

    addrCopy = QAPI_CLONE(SocketAddress, addr);

    /* socket_connect() does a non-blocking connect(), but it
     * still blocks in DNS lookups, so we must use a thread */
    trace_qio_channel_socket_connect_async(ioc, addr);
    qio_task_run_in_thread(task,
                           qio_channel_socket_connect_worker,
                           addrCopy,
                           (GDestroyNotify)qapi_free_SocketAddress,
                           context);
}
</pre>
<p>
这里需要关注callback(socket_outgoing_migration)的去向，因为这涉及到到底在哪执行的它，在qio_task_new里可以看到callback(socket_outgoing_migration)给到了task-&gt;func：
</p>
<pre class="example" id="org4051b7e">
QIOTask *qio_task_new(Object *source,
                      QIOTaskFunc func,
                      gpointer opaque,
                      GDestroyNotify destroy)
{
    ...
    task-&gt;func = func;
    ...
}
</pre>
<p>
继续看qio_channel_socket_connect_async后面的代码，由于socket_connect里会有DNS查询，这可能会长时间block住，所以连接操作在qio_task_run_in_thread里另开线程来做：
</p>
<pre class="example" id="org05eb889">
void qio_task_run_in_thread(QIOTask *task,
                            QIOTaskWorker worker,
                            gpointer opaque,
                            GDestroyNotify destroy,
                            GMainContext *context)
{
    struct QIOTaskThreadData *data = g_new0(struct QIOTaskThreadData, 1);
    QemuThread thread;

    if (context) {
        g_main_context_ref(context);
    }

    data-&gt;worker = worker;
    data-&gt;opaque = opaque;
    data-&gt;destroy = destroy;
    data-&gt;context = context;

    task-&gt;thread = data;

    trace_qio_task_thread_start(task, worker, opaque);
    qemu_thread_create(&amp;thread,
                       "io-task-worker",
                       qio_task_thread_worker,
                       task,
                       QEMU_THREAD_DETACHED);
}
</pre>
<p>
在这个函数里，将新开线程要执行的函数放到了task-&gt;thread-&gt;worker（也就是qio_channel_socket_connect_worker函数），qemu_thread_create一旦创建新的线程后，其执行的起点函数就是qio_task_thread_worker：
</p>
<pre class="example" id="orgbc541fd">
static gpointer qio_task_thread_worker(gpointer opaque)
{
    QIOTask *task = opaque;

    trace_qio_task_thread_run(task);

    task-&gt;thread-&gt;worker(task, task-&gt;thread-&gt;opaque);

    /* We're running in the background thread, and must only
     * ever report the task results in the main event loop
     * thread. So we schedule an idle callback to report
     * the worker results
     */
    trace_qio_task_thread_exit(task);

    qemu_mutex_lock(&amp;task-&gt;thread_lock);

    task-&gt;thread-&gt;completion = g_idle_source_new();
    g_source_set_callback(task-&gt;thread-&gt;completion,
                          qio_task_thread_result, task, NULL);
    g_source_attach(task-&gt;thread-&gt;completion,
                    task-&gt;thread-&gt;context);
    g_source_unref(task-&gt;thread-&gt;completion);
    trace_qio_task_thread_source_attach(task, task-&gt;thread-&gt;completion);

    qemu_cond_signal(&amp;task-&gt;thread_cond);
    qemu_mutex_unlock(&amp;task-&gt;thread_lock);

    return NULL;
}
</pre>
<p>
从这个函数可以看到，首先task-&gt;thread-&gt;worker(qio_channel_socket_connect_worker)-&gt;qio_channel_socket_connect_sync-&gt;socket_connect会完成和对端（dst）的连接，然后创建了一个idle source，其回调函数是qio_task_thread_result，关联的参数是task，task-&gt;func是前面关注过的socket_outgoing_migration函数，通过qio_task_thread_result-&gt;qio_task_complete会完成对socket_outgoing_migration的调用：
</p>
<pre class="example" id="org3a0a115">
void qio_task_complete(QIOTask *task)
{
    task-&gt;func(task, task-&gt;opaque);
    trace_qio_task_complete(task);
    qio_task_free(task);
}
</pre>
<p>
那么qio_task_thread_result自身是怎么调用起来的呢，这涉及到glib GMainLoop事件驱动模型和qemu主循环，过多的细节不是本文的主题，只简单介绍下，在qio_task_thread_worker函数里，创建glib的idle completion(g_idle_source_new函数)，completion事件用于确保连接完成后，回调qio_task_thread_result在主线程执行，实现手段是通过g_source_attach将这个事件加到默认的GMainContext（通常是主线程的GMainLoop）。然后在qemu_main_loop-&gt;main_loop_wait-&gt;os_host_main_loop_wait中会轮询并调用起qio_task_thread_result这个回调函数：
</p>
<pre class="example" id="org5c9db24">
if (g_poll_ret &gt; 0) {
    for (i = 0; i &lt; w-&gt;num; i++) {
        w-&gt;revents[i] = poll_fds[n_poll_fds + i].revents;
    }
    for (i = 0; i &lt; w-&gt;num; i++) {
        if (w-&gt;revents[i] &amp;&amp; w-&gt;func[i]) {
            w-&gt;func[i](w-&gt;opaque[i]);
        }
    }
}
</pre>
<p>
通过异步的方式将连接创建好后，后面就可以关注socket_outgoing_migration函数开始传输虚拟机的工作了．socket_outgoing_migration-&gt;migration_channel_connect-&gt;migrate_fd_connect里会创建一个名为live_migration的热迁移线程，其回调执行函数是migration_thread，下面又继续从这个函数切入分析发送虚拟机的逻辑，也就是本节正式的主题：迁移发送的第一阶段．
</p>

<p>
migration_thread-&gt;qemu_savevm_state_setup里面会统一处理虚拟机热迁移的第一阶段．
</p>

<p>
所有需要热迁移的模块，都需要提供一个SaveVMHandlers的结构体，调用register_savevm_live函数，去分配一个SaveStateEntry，并将SaveVMHandlers给到SaveStateEntry里的SaveVMHandlers类型的ops，SaveVMHandlers里就定义了迁移各个阶段需要调用的函数，比如对于内存模块（内存肯定需要迁移），如下函数调用使用savevm_ram_handlers作为参数去分配注册一个SaveStateEntry，并通过savevm_state_handler_insert插入到savevm_state.handlers里：
</p>

<pre class="example" id="org9bb6918">
void ram_mig_init(void)
{
    qemu_mutex_init(&amp;XBZRLE.lock);
    register_savevm_live("ram", 0, 4, &amp;savevm_ram_handlers, &amp;ram_state);
    ram_block_notifier_add(&amp;ram_mig_ram_notifier);
}
</pre>
<p>
savevm_ram_handlers的定义如下：
</p>
<pre class="example" id="org9f82848">
static SaveVMHandlers savevm_ram_handlers = {
    .save_setup = ram_save_setup,
    .save_live_iterate = ram_save_iterate,
    .save_live_complete_postcopy = ram_save_complete,
    .save_live_complete_precopy = ram_save_complete,
    .has_postcopy = ram_has_postcopy,
    .save_live_pending = ram_save_pending,
    .load_state = ram_load,
    .save_cleanup = ram_save_cleanup,
    .load_setup = ram_load_setup,
    .load_cleanup = ram_load_cleanup,
    .resume_prepare = ram_resume_prepare,
};
</pre>
<p>
这些回调函数里，save_setup就是迁移第一阶段需要调用的函数，save_live_iterate就是迁移第二阶段迭代发送阶段需要调用的函数，并且在dst端还原内存时又会调用到load_state，这个流程前面的节有介绍．
</p>

<p>
有了上面的注册逻辑，再来看上面提到的migration_thread-&gt;qemu_savevm_state_setup处理的第一阶段的逻辑：
</p>

<pre class="example" id="orge7e9813">
void qemu_savevm_state_setup(QEMUFile *f)
{
    SaveStateEntry *se;
    Error *local_err = NULL;
    int ret;

    trace_savevm_state_setup();
    QTAILQ_FOREACH(se, &amp;savevm_state.handlers, entry) {
        if (!se-&gt;ops || !se-&gt;ops-&gt;save_setup) {
            continue;
        }
        if (se-&gt;ops-&gt;is_active) {
            if (!se-&gt;ops-&gt;is_active(se-&gt;opaque)) {
                continue;
            }
        }
        save_section_header(f, se, QEMU_VM_SECTION_START);

        ret = se-&gt;ops-&gt;save_setup(f, se-&gt;opaque);
        save_section_footer(f, se);
        if (ret &lt; 0) {
            qemu_file_set_error(f, ret);
            break;
        }
    }

    if (precopy_notify(PRECOPY_NOTIFY_SETUP, &amp;local_err)) {
        error_report_err(local_err);
    }
}
</pre>
<p>
在这里可以很清楚的看到，通过QTAILQ_FOREACH去遍历所有注册到savevm_state.handlers上的SaveStateEntry，并调用对应的save_setup函数，去做一些对应模块迁移前的准备工作，是为第一阶段，这里目前主要关注内存模块的save_setup函数也就是ram_save_setup的实现，它主要干了两件事情，一是分配并初始化记录脏页信息的bitmap，二是将可迁移的RAMBlock的一些信息比如idstr串，used_length等先传到dst端，下面分析这个函数，ram_save_setup-&gt;ram_init_all里分配并初始化了记录脏页的bitmap图：
</p>

<pre class="example" id="org3f2a529">
static int ram_init_all(RAMState **rsp)
{
    if (ram_state_init(rsp)) {
        return -1;
    }

    if (xbzrle_init()) {
        ram_state_cleanup(rsp);
        return -1;
    }

    ram_init_bitmaps(*rsp);

    return 0;
}
</pre>
<p>
xbzrle主要是用于内存压缩发送，可以减低某些workload的内存发送总量，这里不做详细介绍，留待其它节．ram_state_init里主要功能是算了下总的RAMBlock.used_length的长度并给到RAMState.migration_dirty_pages：
</p>
<pre class="example" id="orgc3ebb61">
static int ram_state_init(RAMState **rsp)
{
    ...
    /*
     * Count the total number of pages used by ram blocks not including any
     * gaps due to alignment or unplugs.
     * This must match with the initial values of dirty bitmap.
     */
    (*rsp)-&gt;migration_dirty_pages = ram_bytes_total() &gt;&gt; TARGET_PAGE_BITS;
    ...
}
</pre>
<p>
分配bitmap主要是在ram_init_all-&gt;ram_init_bitmaps里：
</p>
<pre class="example" id="org77b0372">
static void ram_init_bitmaps(RAMState *rs)
{
    /* For memory_global_dirty_log_start below.  */
    qemu_mutex_lock_iothread();
    qemu_mutex_lock_ramlist();

    WITH_RCU_READ_LOCK_GUARD() {
        ram_list_init_bitmaps();
        /* We don't use dirty log with background snapshots */
        if (!migrate_background_snapshot()) {
            memory_global_dirty_log_start(GLOBAL_DIRTY_MIGRATION);
            migration_bitmap_sync_precopy(rs);
        }
    }
    qemu_mutex_unlock_ramlist();
    qemu_mutex_unlock_iothread();

    /*
     * After an eventual first bitmap sync, fixup the initial bitmap
     * containing all 1s to exclude any discarded pages from migration.
     */
    migration_bitmap_clear_discarded_pages(rs);
}
</pre>
<p>
ram_init_bitmaps-&gt;ram_list_init_bitmaps去分配每个RAMBlock用的bmap，随后通过memory_global_dirty_log_start开启了脏页记录，这个详细过程在前面的脏页跟踪机制有详细的分析，再往后调用migration_bitmap_sync_precopy做了一次脏页信息同步，这点前面的节也详细分析过了．只不过migration_bitmap_sync_precopy-&gt;migration_bitmap_sync里有关于cpu节流的逻辑，这块逻辑限于本节篇幅，留到第二阶段的节去分析，因为做节流的机会不仅是在第一阶段可以做，在第二阶段传送虚拟机数据时也会做．
</p>

<p>
后面继续看下ram_list_init_bitmaps里分配bmap的逻辑：
</p>
<pre class="example" id="org81953a5">
static void ram_list_init_bitmaps(void)
{
    ...
    RAMBlock *block;
    ...
            RAMBLOCK_FOREACH_NOT_IGNORED(block) {
            pages = block-&gt;max_length &gt;&gt; TARGET_PAGE_BITS;
            /*
             * The initial dirty bitmap for migration must be set with all
             * ones to make sure we'll migrate every guest RAM page to
             * destination.
             * Here we set RAMBlock.bmap all to 1 because when rebegin a
             * new migration after a failed migration, ram_list.
             * dirty_memory[DIRTY_MEMORY_MIGRATION] don't include the whole
             * guest memory.
             */
            block-&gt;bmap = bitmap_new(pages);
            bitmap_set(block-&gt;bmap, 0, pages);
            block-&gt;clear_bmap_shift = shift;
            block-&gt;clear_bmap = bitmap_new(clear_bmap_size(pages, shift));
        }
}
</pre>
<p>
这里可以看到使用bitmap_new分配了bitmap所使用的空间，同时使用bitmap_set将里面的位全部设置为1，也就是初始时所有guest的页都要发送到dst．
</p>

<p>
在第一阶段的最后，分析下前面提到的ram_save_setup函数的第二部分，将可迁移RAMBlock的一些信息比如idstr串，used_length等先传到dst端，并借此契机看下qemu里发送数据的简单流程：
</p>

<pre class="example" id="org007b54e">
static int ram_save_setup(QEMUFile *f, void *opaque)
{
      RAMBlock *block;
      ...
      WITH_RCU_READ_LOCK_GUARD() {
        qemu_put_be64(f, ram_bytes_total_common(true) | RAM_SAVE_FLAG_MEM_SIZE);

        RAMBLOCK_FOREACH_MIGRATABLE(block) {
            qemu_put_byte(f, strlen(block-&gt;idstr));
            qemu_put_buffer(f, (uint8_t *)block-&gt;idstr, strlen(block-&gt;idstr));
            qemu_put_be64(f, block-&gt;used_length);
            if (migrate_postcopy_ram() &amp;&amp; block-&gt;page_size !=
                                          qemu_host_page_size) {
                qemu_put_be64(f, block-&gt;page_size);
            }
            if (migrate_ignore_shared()) {
                qemu_put_be64(f, block-&gt;mr-&gt;addr);
            }
        }
    }
    ...
    qemu_fflush(f)
}
</pre>
<p>
qemu_put*类的接口实际就是在网f-&gt;buf里存放数据并添加到iov里，参数f的类型是QEMUFile，这个是qemu里抽象出来表示数据传送的两端，具体和网络socket肯定有一个关联过程，本文不详述．总之在qemu_put*类的接口填好数据，在合适的时机（比如buffer填满）会将数据通过qemu_fflush函数发送出去，以下是一个调用路径：
</p>

<pre class="example" id="orge45dc18">
qemu_fflush-&gt;writev_buffer(channel_writev_buffer)-&gt;qio_channel_writev-&gt;qio_channel_writev_full-&gt;
io_writev(qio_channel_socket_writev/qio_channel_rdma_writev)-&gt;sendmsg
</pre>
<p>
在最后可以看到套接字接口sendmsg了．
</p>

<p>
以上，就是热迁移第一阶段的工作．
</p>
</div>
</div>
