kernel/virt/live-migration.html
<div id="outline-container-org2ddf50f" class="outline-2">
<h2 id="org2ddf50f"><span class="section-number-2">3.</span> 迁移第二阶段</h2>
<div class="outline-text-2" id="text-3">
<p>
第二阶段主要是迭代发送src端的虚拟机状态给dst，其实现函数主要是migration_iteration_run，在migration_thread里调用它：
</p>
<pre class="example" id="org64a0566">
static void *migration_thread(void *opaque)
{
    ...
    while (migration_is_active(s)) {
        if (urgent || !qemu_file_rate_limit(s-&gt;to_dst_file)) {
            MigIterateState iter_state = migration_iteration_run(s);
            if (iter_state == MIG_ITERATE_SKIP) {
                continue;
            } else if (iter_state == MIG_ITERATE_BREAK) {
                break;
            }
        }

        /*
         * Try to detect any kind of failures, and see whether we
         * should stop the migration now.
         */
        thr_error = migration_detect_error(s);
        if (thr_error == MIG_THR_ERR_FATAL) {
            /* Stop migration */
            break;
        } else if (thr_error == MIG_THR_ERR_RECOVERED) {
            /*
             * Just recovered from a e.g. network failure, reset all
             * the local variables. This is important to avoid
             * breaking transferred_bytes and bandwidth calculation
             */
            update_iteration_initial_status(s);
        }

        urgent = migration_rate_limit();
    }
    ...
}
</pre>
<p>
可以看到当migration_iteration_run返回的状态为MIG_ITERATE_BREAK时，就可以退出迭代发送的阶段，进入第三阶段，这是数据正常发送导致的break的情况．但是退出while循环的迭代发送还可能有其它条件，一个是migration_is_active函数：
</p>
<pre class="example" id="org4075eed">
bool migration_is_active(MigrationState *s)
{
    return (s-&gt;state == MIGRATION_STATUS_ACTIVE ||
            s-&gt;state == MIGRATION_STATUS_POSTCOPY_ACTIVE);
}
</pre>
<p>
这个大的条件要求迁移状态是MIGRATION_STATUS_ACTIVE，这在migration_thread-&gt;migration_iteration_run之前通过migration_thread-&gt;qemu_savevm_wait_unplug已经设置了，一般是满足的．再一个条件是发生有urgent的事情，也可以使得进入migration_iteration_run进行迭代发送，或者qemu_file_rate_limit返回0（判断出过去的一次传输没有超过速率限制）也可以再次进入迭代发送，这里主要想分析下qemu_file_rate_limit判断，假如热迁移因为带宽不足而失败时，其调整原理就是来自这里的分析，qemu_file_rate_limit实现如下：
</p>
<pre class="example" id="org0de76a4">
int qemu_file_rate_limit(QEMUFile *f)
{
    if (f-&gt;shutdown) {
        return 1;
    }
    if (qemu_file_get_error(f)) {
        return 1;
    }
    if (f-&gt;xfer_limit &gt; 0 &amp;&amp; f-&gt;bytes_xfer &gt; f-&gt;xfer_limit) {
        return 1;
    }
    return 0;
}
</pre>
<p>
可以看到，当传送的bytes_xfer大于xfer_limit时，就会返回1导致进不了迭代发送，bytes_xfer会在会在qemu_put*类的接口增加，而在每一轮迭代发送结束由以下路径：
</p>
<pre class="example" id="orga439e6d">
migration_thread-&gt;migration_rate_limit-&gt;migration_update_counters-&gt;qemu_file_reset_rate_limit
</pre>
<p>
或者在一轮迭代发送时有成功发送页面时通过如下路径：
</p>
<pre class="example" id="org7ab3549">
migration_thread-&gt;migration_iteration_run-&gt;qemu_savevm_state_iterate(save_live_iterate)-&gt;ram_save_iterate-&gt;ram_find_and_save_block-&gt;ram_save_host_page-&gt;
migration_rate_limit-&gt;migration_update_counters-&gt;qemu_file_reset_rate_limit
</pre>
<p>
最终在qemu_file_reset_rate_limit里进行进行重置：
</p>
<pre class="example" id="org124726c">
void qemu_file_reset_rate_limit(QEMUFile *f)
{
    f-&gt;bytes_xfer = 0;
}
</pre>
<p>
而xfer_limit通过调用qemu_file_set_rate_limit来设置：
</p>
<pre class="example" id="orgabf772b">
void qemu_file_set_rate_limit(QEMUFile *f, int64_t limit)
{
    f-&gt;xfer_limit = limit;
}
</pre>
<p>
不论是migrate_params_apply-&gt;qemu_file_set_rate_limit还是migrate_fd_connect-&gt;qemu_file_set_rate_limit，在未开启postcopy时，其值都被设置成s-&gt;parameters.max_bandwidth / XFER_LIMIT_RATIO)，所以这里比较关键的就是max_bandwidth，max_bandwidth在如下代码定义：
</p>
<pre class="example" id="org43a284b">
DEFINE_PROP_SIZE("x-max-bandwidth", MigrationState,
                  parameters.max_bandwidth, MAX_THROTTLE),
</pre>
<p>
其值为默认的MAX_THROTTLE就是128MB/s，对于因为网络带宽不足（可以测试添加打印发现f-&gt;bytes_xfer &gt; f-&gt;xfer_limit总是满足）导致迁移失败的可以适当调大此参数，设置此参数的目的是防止迁移过程占用太多的带宽影响业务．
</p>

<p>
假设上次发送带宽没有超限，进入到了本节关注的第二阶段：迭代发送，继续往下分析migration_iteration_run函数：
</p>
<pre class="example" id="org08126c5">
static MigIterateState migration_iteration_run(MigrationState *s)
{
    uint64_t pending_size, pend_pre, pend_compat, pend_post;
    bool in_postcopy = s-&gt;state == MIGRATION_STATUS_POSTCOPY_ACTIVE;

    qemu_savevm_state_pending(s-&gt;to_dst_file, s-&gt;threshold_size, &amp;pend_pre,
                              &amp;pend_compat, &amp;pend_post);
    pending_size = pend_pre + pend_compat + pend_post;

    trace_migrate_pending(pending_size, s-&gt;threshold_size,
                          pend_pre, pend_compat, pend_post);

    if (pending_size &amp;&amp; pending_size &gt;= s-&gt;threshold_size) {
        /* Still a significant amount to transfer */
        if (!in_postcopy &amp;&amp; pend_pre &lt;= s-&gt;threshold_size &amp;&amp;
            qatomic_read(&amp;s-&gt;start_postcopy)) {
            if (postcopy_start(s)) {
                error_report("%s: postcopy failed to start", __func__);
            }
            return MIG_ITERATE_SKIP;
        }
        /* Just another iteration step */
        qemu_savevm_state_iterate(s-&gt;to_dst_file, in_postcopy);
    } else {
        trace_migration_thread_low_pending(pending_size);
        migration_completion(s);
        return MIG_ITERATE_BREAK;
    }

    return MIG_ITERATE_RESUME;
}
</pre>
<p>
可以看到如果待发送的pending_size大于threshold_size，就会通过qemu_savevm_state_iterate再次进入迭代发送的流程，此时migration_iteration_run函数自然结束，返回MIG_ITERATE_RESUME状态到了migration_thread的while循环里，在调用migration_rate_limit更新一些统计信息后，就又会进入migration_iteration_run函数进行再一次的迭代发送，这就是整个迭代发送的过程．下面就继续详细分析migration_iteration_run函数．首先是pending_size的获取，通过qemu_savevm_state_pending函数获得pending_size，这可以由三部分组成，只能在dst端虚拟机启动前就要迁移到位的pre部分，在dst端虚拟机运行后可以做page fault从src现拉取的post方式，还有二者兼容的方式．qemu_savevm_state_pending的实现如下：
</p>
<pre class="example" id="orgdcc1574">
void qemu_savevm_state_pending(QEMUFile *f, uint64_t threshold_size,
                               uint64_t *res_precopy_only,
                               uint64_t *res_compatible,
                               uint64_t *res_postcopy_only)
{
    SaveStateEntry *se;

    *res_precopy_only = 0;
    *res_compatible = 0;
    *res_postcopy_only = 0;


    QTAILQ_FOREACH(se, &amp;savevm_state.handlers, entry) {
        if (!se-&gt;ops || !se-&gt;ops-&gt;save_live_pending) {
            continue;
        }
        if (se-&gt;ops-&gt;is_active) {
            if (!se-&gt;ops-&gt;is_active(se-&gt;opaque)) {
                continue;
            }
        }
        se-&gt;ops-&gt;save_live_pending(f, se-&gt;opaque, threshold_size,
                                   res_precopy_only, res_compatible,
                                   res_postcopy_only);
    }
}
</pre>
<p>
可以看到，该函数就是遍历每个save_state.handlers句柄，并调用save_live_pending回调函数去获得还有多少脏页需要发送，对于内存来说这个回调函数的实现就是ram_save_pending：
</p>
<pre class="example" id="orgd5eae4e">
static void ram_save_pending(QEMUFile *f, void *opaque, uint64_t max_size,
                             uint64_t *res_precopy_only,
                             uint64_t *res_compatible,
                             uint64_t *res_postcopy_only)
{
    RAMState **temp = opaque;
    RAMState *rs = *temp;
    uint64_t remaining_size;

    remaining_size = rs-&gt;migration_dirty_pages * TARGET_PAGE_SIZE;

    if (!migration_in_postcopy() &amp;&amp;
        remaining_size &lt; max_size) {
        qemu_mutex_lock_iothread();
        WITH_RCU_READ_LOCK_GUARD() {
            migration_bitmap_sync_precopy(rs);
        }
        qemu_mutex_unlock_iothread();
        remaining_size = rs-&gt;migration_dirty_pages * TARGET_PAGE_SIZE;
    }

    if (migrate_postcopy_ram()) {
        /* We can do postcopy, and all the data is postcopiable */
        *res_compatible += remaining_size;
    } else {
        *res_precopy_only += remaining_size;
    }
}
</pre>
<p>
可以看到其主要的来源就是migration_dirty_pages量，这个量的更新在之前的脏页跟踪机制里介绍过，它通过如下流程在ramblock_sync_dirty_bitmap里更新：
</p>
<pre class="example" id="orgcecc124">
static void ramblock_sync_dirty_bitmap(RAMState *rs, RAMBlock *rb)
{
    uint64_t new_dirty_pages =
        cpu_physical_memory_sync_dirty_bitmap(rb, 0, rb-&gt;used_length);

    rs-&gt;migration_dirty_pages += new_dirty_pages;
    rs-&gt;num_dirty_pages_period += new_dirty_pages;
}

migration_bitmap_sync_precopy-&gt;migration_bitmap_sync-&gt;ramblock_sync_dirty_bitmap
</pre>
<p>
其中migration_bitmap_sync_precopy-&gt;migration_bitmap_sync-&gt;memory_global_dirty_log_sync先到内核里拿取脏页信息．在ram_save_pending函数里，如果不是postcopy（默认配置）且本次计算出的remaing_size小于max_size，就会调用migration_bitmap_sync_precopy去同步内核脏页信息到qemu，同步完再重新计算下remaining_size．max_size其实就是之前传入的threshold_size，threshold_size是根据当前轮实际发送时达到的带宽乘以可以接受的停机时间downtime_limit，也就是说threshold_size的值反映了在最后一轮能够发送的大小，关于它的详细计算后面分析migration_update_counters函数时还会涉及到．也就是说在可以进入第三阶段最后一轮发送时，还需要通过migration_bitmap_sync_precopy再次拉取脏页看看有没有更多的脏页可以发送的，这就是动态脏页更新与发送的机制．现在假如pending_size大于threshold_size，那么就会调用qemu_savevm_state_iterate进行迭代发送，qemu_savevm_state_iterate的主体逻辑很简单，也是遍历savevm_state.handlers上的回调句柄，依次调用save_live_iterate回调函数，这里主要关注内存模块的迭代回调函数ram_save_iterate：
</p>
<pre class="example" id="org247d199">
while ((ret = qemu_file_rate_limit(f)) == 0 ||
        !QSIMPLEQ_EMPTY(&amp;rs-&gt;src_page_requests)) {
    int pages;

    if (qemu_file_get_error(f)) {
        break;
    }

    pages = ram_find_and_save_block(rs, false);
    /* no more pages to sent */
    if (pages == 0) {
        done = 1;
        break;
    }

    if (pages &lt; 0) {
        qemu_file_set_error(f, pages);
        break;
    }

    rs-&gt;target_page_count += pages;

    /*
     * During postcopy, it is necessary to make sure one whole host
     * page is sent in one chunk.
     */
    if (migrate_postcopy_ram()) {
        flush_compressed_data(rs);
    }

    /*
     * we want to check in the 1st loop, just in case it was the 1st
     * time and we had to sync the dirty bitmap.
     * qemu_clock_get_ns() is a bit expensive, so we only check each
     * some iterations
     */
    if ((i &amp; 63) == 0) {
        uint64_t t1 = (qemu_clock_get_ns(QEMU_CLOCK_REALTIME) - t0) /
                      1000000;
        if (t1 &gt; MAX_WAIT) {
            trace_ram_save_iterate_big_wait(t1, i);
            break;
        }
    }
    i++;
}
</pre>
<p>
ram_save_iterate函数的主体就是一个不断寻找脏页并发送的过程，条件qemu_file_rate_limit之前介绍过，src_page_requests其实是支持postcopy的方式，就是dst端已经开始运行了，现在需要的页还在src端，所以发送请求，这些请求都挂在src_page_requests上，然后就是进一步调用ram_find_and_save_block去寻找脏页并发送：
</p>
<pre class="example" id="org80b5ca0">
static int ram_find_and_save_block(RAMState *rs, bool last_stage)
{
    PageSearchStatus pss;
    int pages = 0;
    bool again, found;

    /* No dirty page as there is zero RAM */
    if (!ram_bytes_total()) {
        return pages;
    }

    pss.block = rs-&gt;last_seen_block;
    pss.page = rs-&gt;last_page;
    pss.complete_round = false;

    if (!pss.block) {
        pss.block = QLIST_FIRST_RCU(&amp;ram_list.blocks);
    }

    do {
        again = true;
        found = get_queued_page(rs, &amp;pss);

        if (!found) {
            /* priority queue empty, so just search for something dirty */
            found = find_dirty_block(rs, &amp;pss, &amp;again);
        }

        if (found) {
            pages = ram_save_host_page(rs, &amp;pss, last_stage);
        }
    } while (!pages &amp;&amp; again);

    rs-&gt;last_seen_block = pss.block;
    rs-&gt;last_page = pss.page;

    return pages;
}
</pre>
<p>
该函数首先是通过get_queued_page去处理是否有postcopy的请求，然后才是通过find_dirty_block找到脏页，最后调用ram_save_host_page发送，find_dirty_block-&gt;migration_bitmap_find_dirty使用RAMBlock.bmap去找到脏页信息，这点在之前的脏页机制节也介绍过，find_dirty_block的细节就不再介绍了，ram_save_host_page往下的流程本节也不打算详细分析了，因为脏页信息有了，现在无非就是遍历并发送，这里只是列出下后面的代码路径：
</p>
<pre class="example" id="org772f6e1">
ram_save_host_page-&gt;ram_save_target_page-&gt;ram_save_page-&gt;save_normal_page-&gt;qemu_put_buffer*
</pre>
<p>
qemu_put_buffer*类的接口往后最终会走到sendmsg套接字接口，前面的分析提到过．
</p>

<p>
这里还想分析下migration_rate_limit函数，之前提到过migration_rate_limit-&gt;migration_update_counters里会计算threshold_size，而这个值是控制能否进入第三阶段的一个关键阀值条件：
</p>
<pre class="example" id="orga89d3ec">
static void migration_update_counters(MigrationState *s,
                                      int64_t current_time)
{
    uint64_t transferred, transferred_pages, time_spent;
    uint64_t current_bytes; /* bytes transferred since the beginning */
    double bandwidth;

    if (current_time &lt; s-&gt;iteration_start_time + BUFFER_DELAY) {
        return;
    }

    current_bytes = migration_total_bytes(s);
    transferred = current_bytes - s-&gt;iteration_initial_bytes;
    time_spent = current_time - s-&gt;iteration_start_time;
    bandwidth = (double)transferred / time_spent;
    s-&gt;threshold_size = bandwidth * s-&gt;parameters.downtime_limit;

    s-&gt;mbps = (((double) transferred * 8.0) /
               ((double) time_spent / 1000.0)) / 1000.0 / 1000.0;

    transferred_pages = ram_get_total_transferred_pages() -
                            s-&gt;iteration_initial_pages;
    s-&gt;pages_per_second = (double) transferred_pages /
                             (((double) time_spent / 1000.0));

    /*
     * if we haven't sent anything, we don't want to
     * recalculate. 10000 is a small enough number for our purposes
     */
    if (ram_counters.dirty_pages_rate &amp;&amp; transferred &gt; 10000) {
        s-&gt;expected_downtime = ram_counters.remaining / bandwidth;
    }

    qemu_file_reset_rate_limit(s-&gt;to_dst_file);

    update_iteration_initial_status(s);

    trace_migrate_transferred(transferred, time_spent,
                              bandwidth, s-&gt;threshold_size);
}
</pre>
<p>
这里可以很清楚的看到，bandwidth是实际上次发送能达到的带宽，而downtime_limit是配置所能允许的停机时间，和实际带宽相乘，就是在这么多的停机时间里能发送多少数据，bandwidth之前提到过，没有其它原因的话，它就是配置能允许的最大带宽，这里主要看下downtime_limit的设置，其由如下代码定义：
</p>
<pre class="example" id="org3e6050f">
DEFINE_PROP_UINT64("x-downtime-limit", MigrationState,
                  parameters.downtime_limit,
                  DEFAULT_MIGRATE_SET_DOWNTIME),
</pre>
<p>
这里可以看到，其默认的时间设置就是300ms：
</p>
<pre class="example" id="org0d4815f">
/* Time in milliseconds we are allowed to stop the source,
 * for sending the last part */
#define DEFAULT_MIGRATE_SET_DOWNTIME 300
</pre>
<p>
在migration.json文件里也有解释：
</p>
<pre class="example" id="org9361bd9">
# @downtime-limit: set maximum tolerated downtime for migration. maximum
#                  downtime in milliseconds (Since 2.8)
</pre>
<p>
如果因为downtime_limit设置的较低而引起threshold_size过小而不能进入第三阶段，可以适当的调大downtime_limit．
</p>

<p>
在第二节的最后想分析下qemu提供的节流功能，该功能是解决虚拟机业务快速大量的产生脏页，但是发送脏页的线程其速率没有产生脏页的速率快，这就导致虚拟机迁移一直不能成功进入第三阶段，导致迁移失败．
</p>

<p>
在跌代发送函数migration_iteration_run里会通过qemu_savevm_state_pending去获取剩余还没迁移的内存，qemu_savevm_state_pending里调用ram提供的pending函数为ram_save_pending，ram_save_pending之前也分析过，这次主要关注其节流的逻辑：
</p>
<pre class="example" id="org1d25b63">
static void ram_save_pending(QEMUFile *f, void *opaque, uint64_t max_size,
                             uint64_t *res_precopy_only,
                             uint64_t *res_compatible,
                             uint64_t *res_postcopy_only)
{
    ...    
    if (!migration_in_postcopy() &amp;&amp;
        remaining_size &lt; max_size) {
        qemu_mutex_lock_iothread();
        WITH_RCU_READ_LOCK_GUARD() {
            migration_bitmap_sync_precopy(rs);
        }
        qemu_mutex_unlock_iothread();
        remaining_size = rs-&gt;migration_dirty_pages * TARGET_PAGE_SIZE;
    }
    ...
}
</pre>
<p>
之前有提到过，max_size就是threshold_size，每当剩余要发送的内存小于进入第三阶段的阀值时，就再次尝试通过migration_bitmap_sync_precopy去拉取新的可能的脏内存信息，也就是在migration_bitmap_sync_precopy-&gt;migration_bitmap_sync里有了节流的逻辑：
</p>
<pre class="example" id="org31123c0">
/* more than 1 second = 1000 millisecons */
if (end_time &gt; rs-&gt;time_last_bitmap_sync + 1000) {
    migration_trigger_throttle(rs);

    migration_update_rates(rs, end_time);

    rs-&gt;target_page_count_prev = rs-&gt;target_page_count;

    /* reset period counters */
    rs-&gt;time_last_bitmap_sync = end_time;
    rs-&gt;num_dirty_pages_period = 0;
    rs-&gt;bytes_xfer_prev = ram_counters.transferred;
}
</pre>
<p>
分析这段代码，节流动作的发生并不每次拉取脏页信息时都会发生，必须要超过1s才会进入这个逻辑，判断是否要节流是在migration_trigger_throttle函数里：
</p>
<pre class="example" id="orgf812803">
static void migration_trigger_throttle(RAMState *rs)
{
    MigrationState *s = migrate_get_current();
    uint64_t threshold = s-&gt;parameters.throttle_trigger_threshold;

    uint64_t bytes_xfer_period = ram_counters.transferred - rs-&gt;bytes_xfer_prev;
    uint64_t bytes_dirty_period = rs-&gt;num_dirty_pages_period * TARGET_PAGE_SIZE;
    uint64_t bytes_dirty_threshold = bytes_xfer_period * threshold / 100;

    /* During block migration the auto-converge logic incorrectly detects
     * that ram migration makes no progress. Avoid this by disabling the
     * throttling logic during the bulk phase of block migration. */
    if (migrate_auto_converge() &amp;&amp; !blk_mig_bulk_active()) {
        /* The following detection logic can be refined later. For now:
           Check to see if the ratio between dirtied bytes and the approx.
           amount of bytes that just got transferred since the last time
           we were in this routine reaches the threshold. If that happens
           twice, start or increase throttling. */

        if ((bytes_dirty_period &gt; bytes_dirty_threshold) &amp;&amp;
            (++rs-&gt;dirty_rate_high_cnt &gt;= 2)) {
            trace_migration_throttle();
            rs-&gt;dirty_rate_high_cnt = 0;
            mig_throttle_guest_down(bytes_dirty_period,
                                    bytes_dirty_threshold);
        }
    }
}
</pre>
<p>
这里有几个计算，一个是bytes_xfer_period表示上一个间隔里发送了多少字节，bytes_dirty_period表示上一个间隔里产生了多少字节的脏页，bytes_dirty_threshold是bytes_xfer_period按某个比例进行缩小的值，控制了后面能否调用mig_throttle_guest_down进行节流的动作，其实际表示的是初始脏页速率达到多少的比例就可以开始节流：
</p>
<pre class="example" id="orgf760bd7">
DEFINE_PROP_UINT8("x-throttle-trigger-threshold", MigrationState,
                  parameters.throttle_trigger_threshold,
                  DEFAULT_MIGRATE_THROTTLE_TRIGGER_THRESHOLD),
</pre>
<pre class="example" id="org86bd0a0">
# @throttle-trigger-threshold: The ratio of bytes_dirty_period and bytes_xfer_period
#                              to trigger throttling. It is expressed as percentage.
#                              The default value is 50. (Since 5.0)
</pre>
<p>
继续往下分析，控制是否要节流的还有一个条件migrate_auto_converge函数：
</p>
<pre class="example" id="orge5c9dbc">
bool migrate_auto_converge(void)
{
    MigrationState *s;

    s = migrate_get_current();

    return s-&gt;enabled_capabilities[MIGRATION_CAPABILITY_AUTO_CONVERGE];
}
</pre>
<p>
这其实表明了是否开启节流功能（自动聚合），它默认是不开启：
</p>
<pre class="example" id="org48a24da">
DEFINE_PROP_MIG_CAP("x-auto-converge", MIGRATION_CAPABILITY_AUTO_CONVERGE),
</pre>
<pre class="example" id="org24f5436">
# @auto-converge: If enabled, QEMU will automatically throttle down the guest
#                 to speed up convergence of RAM migration. (since 1.6)
</pre>
<p>
另外一个条件本文不关注，如果条件都满足，就会继续往下调用mig_throttle_guest_down：
</p>
<pre class="example" id="org3bb15bf">
static void mig_throttle_guest_down(uint64_t bytes_dirty_period,
                                    uint64_t bytes_dirty_threshold)
{
    MigrationState *s = migrate_get_current();
    uint64_t pct_initial = s-&gt;parameters.cpu_throttle_initial;
    uint64_t pct_increment = s-&gt;parameters.cpu_throttle_increment;
    bool pct_tailslow = s-&gt;parameters.cpu_throttle_tailslow;
    int pct_max = s-&gt;parameters.max_cpu_throttle;

    uint64_t throttle_now = cpu_throttle_get_percentage();
    uint64_t cpu_now, cpu_ideal, throttle_inc;

    /* We have not started throttling yet. Let's start it. */
    if (!cpu_throttle_active()) {
        cpu_throttle_set(pct_initial);
    } else {
        /* Throttling already on, just increase the rate */
        if (!pct_tailslow) {
            throttle_inc = pct_increment;
        } else {
            /* Compute the ideal CPU percentage used by Guest, which may
             * make the dirty rate match the dirty rate threshold. */
            cpu_now = 100 - throttle_now;
            cpu_ideal = cpu_now * (bytes_dirty_threshold * 1.0 /
                        bytes_dirty_period);
            throttle_inc = MIN(cpu_now - cpu_ideal, pct_increment);
        }
        cpu_throttle_set(MIN(throttle_now + throttle_inc, pct_max));
    }
}
</pre>
<p>
该函数涉及到了迁移的很多参数，先看下这些参数的作用，先是cpu_throttle_initial，它指定了第一次激活节流操作时，应该限制多少cpu运行时间：
</p>
<pre class="example" id="orgec4cef4">
# @cpu-throttle-initial: Initial percentage of time guest cpus are throttled
#                        when migration auto-converge is activated. The
#                        default value is 20. (Since 2.7)
</pre>
<pre class="example" id="orgc05b34c">
DEFINE_PROP_UINT8("x-cpu-throttle-initial", MigrationState,
                  parameters.cpu_throttle_initial,
                  DEFAULT_MIGRATE_CPU_THROTTLE_INITIAL),
</pre>
<pre class="example" id="orgaf0db14">
#define DEFAULT_MIGRATE_CPU_THROTTLE_INITIAL 20
</pre>
<p>
所以cpu_throttle_active发现throttle_percentage为0还没有设置时，就会以这个cpu_throttle_initial去设置．
</p>

<p>
再看cpu_throttle_increment，它表示在每次需要加大节流的力度时，每次递增多少节流的量：
</p>
<pre class="example" id="orga6332bd">
# @cpu-throttle-increment: throttle percentage increase each time
#                          auto-converge detects that migration is not making
#                          progress. The default value is 10. (Since 2.7)

</pre>
<pre class="example" id="org529c04b">
DEFINE_PROP_UINT8("x-cpu-throttle-increment", MigrationState,
                  parameters.cpu_throttle_increment,
                  DEFAULT_MIGRATE_CPU_THROTTLE_INCREMENT),
</pre>
<pre class="example" id="org7ce6b9d">
#define DEFAULT_MIGRATE_CPU_THROTTLE_INCREMENT 10
</pre>
<p>
可以看到默认就是增加10，不过这个值要看是否开启了tailslow，没开才会有用．下面看下cpu_throttle_tailslow参数的作用：
</p>
<pre class="example" id="orgd169f6e">
# @cpu-throttle-tailslow: Make CPU throttling slower at tail stage
#                         At the tail stage of throttling, the Guest is very
#                         sensitive to CPU percentage while the @cpu-throttle
#                         -increment is excessive usually at tail stage.
#                         If this parameter is true, we will compute the ideal
#                         CPU percentage used by the Guest, which may exactly make
#                         the dirty rate match the dirty rate threshold. Then we
#                         will choose a smaller throttle increment between the
#                         one specified by @cpu-throttle-increment and the one
#                         generated by ideal CPU percentage.
#                         Therefore, it is compatible to traditional throttling,
#                         meanwhile the throttle increment won't be excessive
#                         at tail stage.
#                         The default value is false. (Since 5.1)
</pre>
<pre class="example" id="org9a078f7">
DEFINE_PROP_BOOL("x-cpu-throttle-tailslow", MigrationState,
                  parameters.cpu_throttle_tailslow, false),
</pre>
<p>
如果开启了这个参数，先要算下理想的cpu能使用的算力cpu_ideal，它是现在的cpu算里cpu_now乘以一个比率，这个比率是传送速率的一半（在父函数migration_trigger_throttle里默认折算为一半）比上脏页产生的速率，换句话说，只有脏页产生速率是传送速率的一半时，cpu_ideal才会稳定下来而不会被一个0-1的比率值缩放小，都了cpu_ideal，再来看现在的cpu算力cpu_now和cpu_ideal的差距，就是还需要节流多少cpu算力，最后在throttle_inc和默认的增加节流的幅度pct_increment间选择较小的，然后通过cpu_throttle_set去设置节流的值，但是现在要设置的throttle_now+throttle_inc和pct_max之间也要取最小值，这里就又涉及一个参数max_cpu_throttle：
</p>
<pre class="example" id="org9820f0d">
# @max-cpu-throttle: maximum cpu throttle percentage.
#                    Defaults to 99.
#                    (Since 3.1)
</pre>
<pre class="example" id="orge8ae912">
DEFINE_PROP_UINT8("max-cpu-throttle", MigrationState,
                  parameters.max_cpu_throttle,
                  DEFAULT_MIGRATE_MAX_CPU_THROTTLE),
</pre>
<pre class="example" id="org8b8f033">
#define DEFAULT_MIGRATE_MAX_CPU_THROTTLE 99
</pre>
<p>
max_cpu_throttle控制了最大能节流多少cpu算力，现在继续往下分析cpu_throttle_set：
</p>
<pre class="example" id="org8e96f27">
void cpu_throttle_set(int new_throttle_pct)
{
    /*
     * boolean to store whether throttle is already active or not,
     * before modifying throttle_percentage
     */
    bool throttle_active = cpu_throttle_active();

    /* Ensure throttle percentage is within valid range */
    new_throttle_pct = MIN(new_throttle_pct, CPU_THROTTLE_PCT_MAX);
    new_throttle_pct = MAX(new_throttle_pct, CPU_THROTTLE_PCT_MIN);

    qatomic_set(&amp;throttle_percentage, new_throttle_pct);

    if (!throttle_active) {
        cpu_throttle_timer_tick(NULL);
    }
}
</pre>
<p>
这个函数继续将要节流的百分比钳制在CPU_THROTTLE_PCT_MAX和CPU_THROTTLE_PCT_MIN之间，同时通过qatomic_set来设置全局的节流比分比变量throttle_percentage为new_throttle_pct，如果这个值还没有被设置过（之前为0），那么就是首次开启节流功能，通过调用cpu_throttle_timer_tick函数来开启：
</p>
<pre class="example" id="org79f4fc2">
static void cpu_throttle_timer_tick(void *opaque)
{
    CPUState *cpu;
    double pct;

    /* Stop the timer if needed */
    if (!cpu_throttle_get_percentage()) {
        return;
    }
    CPU_FOREACH(cpu) {
        if (!qatomic_xchg(&amp;cpu-&gt;throttle_thread_scheduled, 1)) {
            async_run_on_cpu(cpu, cpu_throttle_thread,
                             RUN_ON_CPU_NULL);
        }
    }

    pct = (double)cpu_throttle_get_percentage() / 100;
    timer_mod(throttle_timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL_RT) +
                                   CPU_THROTTLE_TIMESLICE_NS / (1 - pct));
}
</pre>
<p>
这个函数逻辑还是简单的，首先通过cpu_throttle_get_percentage判断下当前的节流的百分比为0话意味着没有必要进行节流操作，然后就是CPU_FOREACH针对每个虚拟cpu运行cpu_throttle_thread进行节流，不过条件是每个vcpu还没有开始节流，也就是qatomic_xchg返回的throttle_thread_scheduled的旧值为0．
</p>

<p>
最后的两行代码是比较有意思的，它需要结合cpu_throttle_thread函数才能理解深刻，现在先单就理解这两句，首先pct表示的是节流的一个百分比，本来节流的值是0-99的整型数值，现在就是把她转换成了一个0-1的百分比的小数．timer_mod调用是想修改throttle_timer这个定时器的下一次超时时间，timer_mod的回调函数就是cpu_throttle_timer_tick:
</p>
<pre class="example" id="org81b6884">
void cpu_throttle_init(void)
{
    throttle_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL_RT,
                                  cpu_throttle_timer_tick, NULL);
}
</pre>
<p>
也就是说，在经过CPU_THROTTLE_TIMESLICE_NS / (1 - pct)了这么多时间后，就会再次进入cpu_throttle_timer_tick进行节流．CPU_THROTTLE_TIMESLICE_NS是默认的时间片：
</p>
<pre class="example" id="orge41b75e">
#define CPU_THROTTLE_TIMESLICE_NS 10000000
</pre>
<p>
可以看到为10ms，那为什么不直接使用这个时间片作为周期而要乘以1/(1-pct)，这里个人分析作者的意图是，在cpu节流过程中，cpu的算力是逐步降低的，按固定频率运行某个回调函数（或者说成按固定频率执行某项任务）这种节奏本身就是不对的，因为cpu算力不是恒定不变的，所以执行节流回调这件任务也当以一个变化的周期来执行，而不是恒定的．那么这个变化的周期应当怎么变化呢，是变大还是变小？可以想见，随着cpu算力的下降，那么这个周期应该拉长变大，也就是说，cpu算力既然已经下降了，就不能花费太多的cpu执行时间去执行一个回调，所以pct越大1/(1-pct)越大，隔的越久才再次执行节流回调．继续看cpu_throttle_thread函数：
</p>
<pre class="example" id="org541bc3c">
static void cpu_throttle_thread(CPUState *cpu, run_on_cpu_data opaque)
{
    double pct;
    double throttle_ratio;
    int64_t sleeptime_ns, endtime_ns;

    if (!cpu_throttle_get_percentage()) {
        return;
    }

    pct = (double)cpu_throttle_get_percentage() / 100;
    throttle_ratio = pct / (1 - pct);
    /* Add 1ns to fix double's rounding error (like 0.9999999...) */
    sleeptime_ns = (int64_t)(throttle_ratio * CPU_THROTTLE_TIMESLICE_NS + 1);
    endtime_ns = qemu_clock_get_ns(QEMU_CLOCK_REALTIME) + sleeptime_ns;
    while (sleeptime_ns &gt; 0 &amp;&amp; !cpu-&gt;stop) {
        if (sleeptime_ns &gt; SCALE_MS) {
            qemu_cond_timedwait_iothread(cpu-&gt;halt_cond,
                                         sleeptime_ns / SCALE_MS);
        } else {
            qemu_mutex_unlock_iothread();
            g_usleep(sleeptime_ns / SCALE_US);
            qemu_mutex_lock_iothread();
        }
        sleeptime_ns = endtime_ns - qemu_clock_get_ns(QEMU_CLOCK_REALTIME);
    }
    qatomic_set(&amp;cpu-&gt;throttle_thread_scheduled, 0);
}
</pre>
<p>
这个函数里终于看到了所谓节流到底是什么操作，其实就是sleep，将vcpu对应的线程睡眠就是类似于物理cpu的降频操作，这里最关键的是睡多久，1/(1-pct)相当于是整个周期的长度，用pct睡眠占比除以(1-pct)就是睡眠的时间了，这样可以保证在某个（变化的）周期内，睡眠占pct，而运行占1-pct，然后在while循环里，只要没睡够这么多时间，就会循环一直睡．而一旦睡够了，throttle_thread_scheduled就会被设置为0，这会使得cpu_throttle_timer_tick定时器回调函数执行时看到它为0，进而开启新一轮的睡眠．
</p>

<p>
以上就是迁移第二阶段的分析．
</p>
</div>
</div>
