kernel/virt/live-migration.org
* 迁移第三阶段
最后一个阶段不打算详细分析了，因为这一阶段就没有多少数据需要传送了，之前的分析已经详细说明了进入第三阶段的条件．第三阶段主要就是停止src端的虚拟机，并统计一下downtime的时间等，代码就略过不详加分析了．


* dst端还原虚拟机
dst还原虚拟机需要以migrate-incoming命令运行qemu进程，这样qemu起来后走qmp_migrate_incoming函数去接受src发来的内存．

qemu里qmp相关的代码用于处理json数据格式的命令，主要针对编程方式与qemu交互（相对的，qemu还提供一种和其交互的方式叫hmp，这主要是给人类进入monitor后台/或其它界面比如virsh以键盘输入命令的方式），典型的比如libvirt．libvirt会事先在dst端以defer启动/usr/libexec/qemu-kvm，随后构建migrate-incoming json命令发给qemu进程，这会导致qemu最终来到ram_load去还原内存．下面先介绍这个整体过程的代码实现细节，再介绍一点还原内存的细节．

libvirt里启动虚拟机的流程都会来到qemuProcessStart函数，对于热迁移的情况，其migrateFrom参数有值，这样就会生成一个qemuProcessIncomingDef结构体，用来描述从哪里接受内存：
#+begin_example
int
qemuProcessStart(virConnectPtr conn,
                 virQEMUDriver *driver,
                 virDomainObj *vm,
                 virCPUDef *updatedCPU,
                 virDomainAsyncJob asyncJob,
                 const char *migrateFrom,
                 int migrateFd,
                 const char *migratePath,
                 virDomainMomentObj *snapshot,
                 virNetDevVPortProfileOp vmop,
                 unsigned int flags)
{
    ...
    qemuProcessIncomingDef *incoming = NULL;
    ...
    if (migrateFrom) {
    incoming = qemuProcessIncomingDefNew(priv->qemuCaps, NULL, migrateFrom,
                                         migrateFd, migratePath);
    if (!incoming)
        goto stop;
    } 
}
#+end_example
有了incoming，随后qemuProcessStart先通过qemuProcessLaunch函数使用execv系统调用启动/usr/libexec/qemu-kvm，然后qemuProcessStart又会调用qemuMigrationDstRun给这个qemu-kvm进程以json的格式发送migrate-incoming命令，先看启动/usr/libexec/qemu-kvm的过程：
#+begin_example
qemuProcessStart->qemuProcessLaunch->virCommandRun->virCommandRunAsync->virExec
#+end_example
在最后的virExec便有：
#+begin_example
    if (cmd->env)
        execve(binary, cmd->args, cmd->env);
    else
        execv(binary, cmd->args);
#+end_example
binary先就通过virExec->virCommandGetBinaryPath调用从virCommand结构体里得到，其实就是virCommand:binaryPath．

再来看给起来的qemu进程发送migrate-incoming json命令的过程：

#+begin_example
qemuProcessStart->qemuMigrationDstRun->qemuMonitorMigrateIncoming->qemuMonitorJSONMigrateIncoming
#+end_example
qemuMonitorJSONMigrateIncoming的实现如下：
#+begin_example
int
qemuMonitorJSONMigrateIncoming(qemuMonitor *mon,
                               const char *uri)
{
    g_autoptr(virJSONValue) cmd = NULL;
    g_autoptr(virJSONValue) reply = NULL;

    if (!(cmd = qemuMonitorJSONMakeCommand("migrate-incoming",
                                           "s:uri", uri,
                                           NULL)))
        return -1;

    if (qemuMonitorJSONCommand(mon, cmd, &reply) < 0)
        return -1;

    return qemuMonitorJSONCheckError(cmd, reply);
}
#+end_example
在这里可以十分明确的看到通过qemuMonitorJSONMakeCommand构建了json格式的migrate-incoming命令，并且使用qemuMonitorJSONCommand函数去给qemu进程发送这个命令，这个发送过程本文不研究了，因为那和本文的主题相去甚远，总结来说这个过程就是使用进程通信方式（libvirt使用GScoket）去发送数据到另一个进程．

下面介绍下qemu接收到命令的处理过程，qemu侧收到migrate-incoming命令时，其对应的处理函数其实就是qmp_migrate_incoming，但是这种对应的调用关系并不是那么明晰．这涉及到qapi接口，qemu有一个文件叫qapi/migration.json，里面描述了迁移相关的一些命令，比如对于migrate-incoming来说有：

#+begin_example
##
# @migrate-incoming:
#
# Start an incoming migration, the qemu must have been started
# with -incoming defer
#
# @uri: The Uniform Resource Identifier identifying the source or
#       address to listen on
#
# Returns: nothing on success
#
# Since: 2.3
#
# Notes:
#
# 1. It's a bad idea to use a string for the uri, but it needs to stay
#    compatible with -incoming and the format of the uri is already exposed
#    above libvirt.
#
# 2. QEMU must be started with -incoming defer to allow migrate-incoming to
#    be used.
#
# 3. The uri format is the same as for -incoming
#
# Example:
#
# -> { "execute": "migrate-incoming",
#      "arguments": { "uri": "tcp::4446" } }
# <- { "return": {} }
#
##
{ 'command': 'migrate-incoming', 'data': {'uri': 'str' } }
#+end_example
最后一行是真正libvirt以json格式发送给qemu的数据，可以看到里面有要执行的命令migrate-incoming，以及数据．前面的描述都是注释，解释这个命令是干嘛的，并且可以看到，一般迁移使用的端口是4446，协议是tcp．一旦在migration.json里配置了一个命令，在编译构建的时候，scripts/qapi下的脚本会解析这个json文件，最终会在build/qapi/qapi-init-commands.c里生成C函数调用qmp_register_command以绑定命令以及对应命令的处理函数，scripts/qapi下的Python脚本解析.json配置文件，其中一个最主要的工作就是将migrate-incoming这样配置的串，转换成migrate_incoming，并在其前拼上qmp_串，最终组成qmp_migrate_incoming串（符号），这个名字的函数在qemu代码里是有定义的，这其实就对qemu侧编写qmp接口和libvirt交互提出了命名约束，比如.json有aaa-bbb这样的命令，那么在qemu里就要有qmp_aaa_bbb这样的函数来处理aaa-bbb命令，简单的使用：

#+begin_example
grep qmp_ scripts/qapi -Rn
#+end_example
可以看到：
#+begin_example
scripts/qapi/commands.py:46:%(c_type)s qmp_%(c_name)s(%(params)s);
#+end_example
这种拼接的逻辑．

以社区较新的qemu代码（而不是qemu 6.2，但原理一样）一份编译结果可以看到json里的命令名字和对应的处理函数的绑定动作，对qmp_register_command的调用诚如前面提到的，是由py脚本在编译时自动生成在build/qapi/qapi-init-commands.c文件里：
#+begin_example
    qmp_register_command(cmds, "migrate-incoming",
                         qmp_marshal_migrate_incoming, 0, 0);
#+end_example
而qmp_register_command的实现如下：
#+begin_example
void qmp_register_command(QmpCommandList *cmds, const char *name,
                          QmpCommandFunc *fn, QmpCommandOptions options,
                          unsigned special_features)
{
    QmpCommand *cmd = g_malloc0(sizeof(*cmd));

    /* QCO_COROUTINE and QCO_ALLOW_OOB are incompatible for now */
    assert(!((options & QCO_COROUTINE) && (options & QCO_ALLOW_OOB)));

    cmd->name = name;
    cmd->fn = fn;
    cmd->enabled = true;
    cmd->options = options;
    cmd->special_features = special_features;
    QTAILQ_INSERT_TAIL(cmds, cmd, node);
}
#+end_example
可见其就是用传进来的命令名字migrate-incoming以及对应的处理函数qmp_marshal_migrate_incoming来生成了QmpCommand命令，并加入到了cmds这个全局的命令表里，当然对于qemu 6.2来说没有qmp_marshal_migrate_incoming这样的函数，而是qmp_migrate_incoming去处理，但原理一样．

libvirt的命令发过来后，最终就会来到qmp_dispatch取出cmd里的fn去执行：
#+begin_example
    if (!!(cmd->options & QCO_COROUTINE) == qemu_in_coroutine()) {
        monitor_set_cur(qemu_coroutine_self(), cur_mon);
        cmd->fn(args, &ret, &err);
        monitor_set_cur(qemu_coroutine_self(), NULL);
    } else {
#+end_example
以上就是QMP的工作流程，总之最后就是通过qmp_migrate_incoming函数，dst进入了接收内存并还原的流程里．对于迁移了需要还原状态的模块（典型的比如内存），都会在SaveVMHandlers:load_state这个成员里实现还原的办法，所以最终针对内存的还原通过以下流程可以到达load_state（ram_load）函数：
#+begin_example
qmp_migrate_incoming->qemu_start_incoming_migration->socket_start_incoming_migration->socket_start_incoming_migration_internal->
socket_accept_incoming_migration->migration_channel_process_incoming->migration_ioc_process_incoming->migration_incoming_process->
process_incoming_migration_co->qemu_loadvm_state->qemu_loadvm_state_main->qemu_loadvm_section_part_end/qemu_loadvm_section_start_full->
vmstate_load->load_state(ram_load)
#+end_example
后续的ram_load本文不再介绍，这可以另开一个大的主题在另外的文档介绍．

# * 几个问题
# 本层具体的研究几个问题的细节：
# + 发送的内存页面，其内容具体是在哪里的代码获取的．
# + RDMA方式如何用起来．
# + PML是否开启使用．
# + 设备状态的迁移流程．
# + 做实验，针对不同的虚拟机内存写速率，调优几个参数．
# + 详细分析，测试，应用几个迁移阶段的功能，dirty ring，x-colo，x-background-snapshot，x-xbzrle，x-compress，multifd．
